var lyricsLibrary = [
`
当我抬头仰望

V1
人算什么  祢竟顾念他
世人算什么  祢竟眷顾他
祢赐下荣耀尊贵  作为他冠冕
使地上万物都俯伏在他面前

V2
我算什么  祢竟顾念我
我没做什么  祢却垂怜我
当我未出生以前  祢已先爱我
为了我打造专属的人生路

C1
当我抬头仰望祢手造的天
深知祢多么爱我远超过一切
患难困苦  死荫幽谷
也无法将我与祢的爱隔绝

C2
当我放下自己垂靠祢怀里
我的灵雀跃欢欣不停赞美祢
耶稣基督  我的救主
祢的宝血赎回了我的生命  耶稣

B
不再悲伤  不再彷徨
祢的爱拥抱我遮盖了一切
我深知道  世上所有
都无法将我与祢的爱隔绝
`,
`
我宁愿有耶稣

V1
我宁愿有耶稣  胜于金银
我宁属耶稣  胜过财富无边
我宁愿有耶稣  胜于地土
愿主钉痕手  引导我前途

V2
我宁愿有耶稣 胜于称扬
我宁忠于主  满足主的心肠
我宁愿有耶稣  胜于美名
愿对主忠诚  宣扬主圣名

C
胜过做君王  虽统治万方
却仍受罪恶捆绑
我宁愿有耶稣  胜于世上
荣华  富贵  声望
`,
`
Shekinah荣耀

V
我等候祢  我等候祢
我等候祢  走进这里

PreC
在这里等候祢的同在
在这里等候祢的同在
Shekinah  荣耀降下
Shekinah  荣耀降下

C
全然释放  祢宝贵圣灵
Shekinah  降下来
Shekinah  降下来

B1
You move  我们要更多
You speak  我们要更多
You move  我们要更多
完全得着祢

B2
渴慕祢  渴慕祢  渴慕祢
渴慕祢  渴慕祢  渴慕祢
渴慕祢圣灵
`,
`
神羔羊配得

V1
感谢祢的十字架
感谢祢付上代价
担当我罪和羞愧  使我完全
赐下奇妙恩典

V2
感谢祢无比大爱
感谢祢钉痕双手
宝血洗净我污秽  使我了解
祢完全包容赦免

C
神羔羊配得  坐在宝座上
头戴着尊贵冠冕  祢作王到永远
来尊崇赞美  耶稣神儿子
从天降下被钉十架  神羔羊配得
`,
`
我神我王

V
除祢以外  天上有谁
祢是我所爱慕
虽我肉体  渐渐衰退
祢是我的力量

PreC
走过死荫幽谷  我仍要宣扬
祢与我同在  祢使软弱者得刚强

C
我神我王  我信靠祢
我的盼望  我仰望祢
祢是我心里的力量
我的福分直到永远

B
受患难  却不被压碎
心困惑  却没有绝望
受逼迫  却不被撇弃
被打倒  却没有灭亡
`,
`
叫我抬起头的神

V
耶和华是我的主  必不致动摇
有耶和华的帮助  还要惧谁呢
耶和华是我牧者  必不致缺乏
有耶和华作我旌旗  必全然得胜

C
耶和华是我四围的盾牌  是我的荣耀
又是叫我抬起头的神
一宿虽然有哭泣  早晨我们必欢呼
祢是我的磐石  我的帮助
`,
`
扬声唱哈利路亚

V1
扬声唱哈利路亚  在我的仇敌面前
扬声唱哈利路亚  胜过不信和怀疑
扬声唱哈利路亚  赞美是我的武器
扬声唱哈利路亚  天堂降临得胜利

V2
扬声唱哈利路亚  用尽我的全心全意
扬声唱哈利路亚  我看见黑暗都逃离
扬声唱哈利路亚  当我身处未知的奥秘
扬声唱哈利路亚  爱使我不再恐惧

C
我要歌唱  就算在风暴之中
我扬声赞美  呼喊直到充满全地
从灰烬之中  盼望升起
死亡已溃败  君王已复活

B1
我要扬声赞美
我要扬声赞美
我要扬声赞美
我要扬声赞美

B2
我要扬声赞美  在我的仇敌面前
我要扬声赞美  胜过不信和怀疑
我要扬声赞美  赞美是我的武器
我要扬声赞美  天堂降临得胜利
`,
`
耶稣唯有你

V1_1
谁让太阳升起
照耀这地带来全新生命
耶稣  唯有祢
谁让星空降临
看我安然进入甜美梦境
耶稣  唯有祢

V1_2
谁供应我丰富生命  谁看顾了我所需
谁会与我同行  伴我成长  渡过一切经历
耶稣  唯有祢
耶稣  唯有祢

V2_1
谁看见我伤痛
在软弱无助时扶持着我
耶稣  唯有祢
谁平静了风浪
在绝望恐惧时与我同在
耶稣  唯有祢

V2_2
谁担当了我的罪孽  谁呵护着我的心
谁将我的恐惧  所有意念钉在十字架上
耶稣  唯有祢
耶稣  唯有祢

C
我高举双手  扬声歌唱
一生年日  一生成败  一切所有
将我的生命  完全献上
唯有祢配得  耶稣  唯有祢
`,
`
苏醒

V1
黎明之际  盼望兴起
我仰望祢  宣告祢名
让我与祢  心跳合一
就在这里  与祢同行

V2
在我眼中有火  被祢点燃
不羁的爱  燃烧起来
永恒的光  街头绽放
祢突破黑夜冲出来

PreC
祢的爱一直都在
永远不会离开
为了我  而存在
要点燃这个世代

C
祢让我苏醒  让我苏醒
祢的爱充满我心

B
祢的爱  祢的爱
祢的爱  到永远（我知道）
`,
`
俯伏

V1
俯伏  在祢面前
俯伏  祢是我的主
敬拜  得见祢荣面
献上我的一切

V2
俯伏  放下主权
俯伏  倾倒我的爱
敬拜  与祢面对面
祢爱充满同在

C
我的心  专注于祢
专注于祢  我的主
我一生  单单敬拜
单单敬拜  我的主

B
赏赐在于祢  收取在于祢
我心坚定  勇敢向前行
赏赐在于祢  收取在于祢
我心坚定  勇敢向前行
`,
`
我要顺服

V
耶稣基督是至宝
是生命中的美好
十字架是我的荣耀
一生都跟随快跑

C1
我要顺服  因为我爱祢
无论何处  到哪里都忠心
世界万物  都丢弃看作粪土
为要得着耶稣基督

C2
我要顺服  因为我爱祢
无论何处  到哪里都忠心
一生活出  基督福音的托付
献给耶稣  我所有的全部
`,
`
这是奇妙恩典

V1
谁战胜黑暗  罪恶的权势
谁爱有能力  远胜过一切
荣耀的君王  万王之王耶稣

V2
谁命令雷声  震动这世界
谁令人赞叹  祂奇妙作为
荣耀的君王  万王之王耶稣

C
这是奇妙恩典  祢的爱不改变
祢竟会代替我  为我承担十架
舍下祢的生命  释放我得自由
耶稣我歌颂  祢所做的一切

V3
谁从混乱中  领我回正路
谁使这孤儿  成为神儿女
荣耀的君王  荣耀的耶稣

V4
谁统管列国  以真理公义
在祂荣耀中  闪亮如晨星
荣耀的君王  万王之王耶稣

B
尊贵的羔羊  祢配得
征服死亡的君王  祢配得
配得  配得  耶稣
`,
`
安静知道

V
安静 知道  因祢是我神
安静 安静  因祢是我的神

C
万国知道  祢至圣尊名
全地传颂  响彻雷鸣
崇山峻岭  传扬祢是神
人类无法  无法承受
祢恩典宝座而来的荣耀
所以我们在祢面前安静

B
敬畏着祢  敬畏着祢
屈膝敬拜  俯伏敬拜
万世万代  祢国度永无穷
`,
`
赞美中信心不断升起

V
我的口  要不停赞美
我的手  要不停高举
因祢应许  是我的信心
每个困难中  我经历神迹

C
赞美中  信心不断升起
泪水中  我依然高声唱
祢的信实  上达穹苍
祢的应许  从不落空
赞美中  信心不断升起
泪水中  我依然高声唱
纵然前路迷茫  我心失望
祢的话是灯  照耀前方
`,
`
我的生命献给你

V
献上生命  给最爱的耶稣
完全顺服  完全降服
因祢恩典  使我得以事奉祢
祢的选召没有怀疑

C
我的生命献给祢  背起十架跟随祢
愿祢的荣耀  彰显在我生命
我的心不要忘记  祢如何为我舍命
耶稣我爱祢  喜乐地跟随祢
`,
`
你信实何广大

C
祢信实何广大  祢信实何广大
每早晨赐下新丰盛恩惠
我一切需要  祢手丰富预备
祢信实何广大  显在我身

Coda
阿们　阿们　阿们　阿们
`,
`
扬声欢呼赞美

V
扬声欢呼赞美称颂我的王
高声颂扬欢唱哈利路亚
来到主宝座前尊崇赞美祂
我们欢呼喜乐进入神的面前

C
祢是创造主  祢施行拯救
祢已救赎我  祢是主  最大的医生
祢是丰盛之主  祢是我的牧者引领我
耶稣我君王  我赞美祢
`,
`
一切歌颂赞美

V
一切歌颂赞美  都归我主我的神
祢是配得歌颂与赞美
我们高声呼喊  高举耶稣圣名
哈利路亚

C
赞美主  哈利路亚
赞美主  哈利路亚
哈利路亚
`,
`
主我仰望你

V
主我仰望祢  我全然信靠祢
赐我异象  能看见祢心意
主我仰望祢  我帮助来自祢
赐我智慧  凡事都在祢手里

C
我的力量我爱祢  我的盾牌我爱祢
哦 我的磐石我爱祢  从永远到永远
我要爱祢主
哈利路亚神掌权  哈利路亚神掌权
哦 哈利路亚神掌权  从永远到永远
哈利路亚
`,
`
我安然居住

V
我来到祢宝座  献上我的祷告
在这宁静时刻  我听见祢的声音
因为祢的爱  已经找到了我
使我配得走进祢的同在里
在这安静时刻  祢聆听我呼求
享受在祢的荣耀圣洁中

C
求祢仰起脸来光照我的心
祢使我心充满了快乐
主啊祢是我全然信靠
耶和华使我安然居住
`,
`
耶稣，万国的盼望

V
耶稣  万国的盼望
耶稣  忧伤者的安慰
祢是这世界唯一的盼望
耶稣  黑暗中的光
耶稣  现实中的真理
祢是这世界唯一的盼望

PreC
因祢为我道成肉身
断开黑暗  复活得胜

C
祢是我神  永住我心
祢是磐石  我所倚靠
祢是真光  照亮在全世界之上
祢已经复活  战胜惧怕
和平君王  领我亲近
耶稣我主  祢是我永活的盼望
我信靠祢
`,
`
生命活水充满我

V
在祢宝座前
是我藏身处
祢必以得救的乐歌
四面来环绕我

PreC
主祢是生命的源头
主祢是永恒的真光
在祢圣洁的光中
我得自由必见光

C
充满我  洁净我
在祢宝座前有生命水涌流
更新医治我
充满我  洁净我
在祢宝座前有生命水涌流
更新医治我
`,
`
安静

V
安静  让平安入我心
深深知道祢是我的神
风浪  让我灵更坚定
在我身旁祢使风浪平息

C
我不害怕  我仍然要敬拜
祢陪我走向应许之处
充满盼望  我一生要敬拜
生命满有祢的印记
`,
`
我渴望看见

V
我们等候主  不住寻求祢面
昼夜地祷告  为这世代呼求
侧耳来垂听  谦卑悔改声音
愿救赎和医治临到这地

C1
我渴望看见祢的荣耀彰显
像云彩围绕充满在这地
圣灵如风地吹进  每颗枯干的心灵
我们灵魂再次地苏醒

C2
我渴望看见祢的荣耀彰显
祷告的声音如水不停息
父亲回转向儿女  儿女回转向父亲
每个世代合一敬拜祢

B1
不停地叩门  不停地寻求
天上的门为我们打开
不停地祷告  不停地呼喊
呼求复兴临到这世代

B2
我们在叩门  我们在寻求
天上的门为我们打开
我们在祷告  我们在呼喊
呼求复兴临到这世代
`,
`
我们的神

V
诸天述说天父的荣耀
穹苍传扬奇妙的作为
张开双手  万物得饱足
万口承认祢是我们的神

C
我们的神  坐在宝座上
圣殿充满荣耀  万民敬拜
全能的神  我们尊崇祢
圣洁荣耀  尊贵  能力  都归于祢

1B
祢说话  命立就立
祢吹气  就得生命
万物齐唱哈利路亚
圣哉  圣哉  圣哉

C
我们的神  坐在宝座上
圣殿充满荣耀  万民敬拜
全能的神  我们尊崇祢
圣洁荣耀  尊贵  能力  都归于祢
`,
`
前来敬拜

V
哈利路亚  哈利路亚
前来敬拜永远的君王
哈利路亚  哈利路亚
大声宣告主荣耀降临

C
荣耀尊贵  能力权柄归于祢
祢是我的救主  我的救赎
荣耀尊贵  能力权柄归于祢
祢是配得  祢是配得
祢是配得  我的敬拜

B
荣耀尊贵  美丽无比
神的儿子  耶稣我的主
荣耀尊贵  美丽无比
神的儿子  耶稣我的主
`,
`
我们呼求

V
主 我们同心在祢面前  以祷告寻求祢面
我们转离所有的恶行  定意单单跟随祢
主我们是属祢的子民  求赐下父神的心
我们要回转向祢父神  也要看见复兴

C
我们呼求祢阿爸父  设立祢宝座在这地
祢必睁眼看侧耳垂听  奉主名的呼求
万民都要来敬拜祢  荣耀高举祢的圣名
复兴这地  全能的君王  我们欢迎祢
`,
`
我们一起祷告吧

V
我们一起祷告吧
来到主跟前屈膝敬拜
祂是怜悯的主
我们向着天举起双手

C
求祢打开天上门
将丰沛的恩雨  滋润充满整个大地
终于看到主降临
公义的雨丝  浇灌在我们的身上
`,
`
我们在天上的父

V
我们在天上的父  祢的名为圣
愿祢的国降临  愿祢旨意成全
在地上如同在天上  愿祢国降临
在地上如同在天上  愿祢国降临

PreC
愿祢国降临  愿祢国降临

C
国度属于祢  权能属于祢
荣耀属于祢  到永远  阿们
`,
`
每当我瞻仰你

V1
每当我瞻仰祢至圣荣面
每当我在爱中仰望祢
在祢荣耀光中
所有一切都失去光彩

V2
何等喜乐当我进入祢心意
我全心成为祢爱的宝座
在祢荣耀光中
所有一切都失去光彩

C
我敬拜祢  我敬拜祢
我一生活着为要敬拜祢
`,
`
我的救赎者活着

V1
我知道  我的救赎者活着
祂是永活的主
当我在深谷迷失时
祂领我走正义路

V2
我知道  我的救赎者活着
祂是永活的主
当我在旷野孤独时
祂伴我作我的灯

C1
我知道我的救赎者永远活着
我心不再忧虑
我要在每一个日夜中
领受祂的丰盛之爱

C2
我知道我的救赎者永远活着
我灵不再沉睡
当号角响起的那一天
我将见祂荣光之面
`,
`
我知谁掌管明天

V1
我不知明天的道路  每一天只为主活
我不借明天的太阳  因明天或许阴暗
我不要为将来忧虑  因我信主的应许
我今天要与主同行  因祂知前面如何

V2
每一步越走越光明  像攀登黄金阶梯
每重担越挑越轻省  每朵云披上银衣
在那里阳光常普照  在那里没有眼泪
在美丽彩虹的尽头  众山岭与天相连

V3
我不知明天的道路  或遭遇生活苦楚
但那位养活麻雀者  祂必然也看顾我
祂是我路途的良伴  或经过水火之灾
但救主必与我同在  祂宝血把我遮盖

C
有许多未来的事情
我现在不能识透
但我知谁掌管明天
我也知谁牵我手
`,
`
生命活水充满我

V
在祢宝座前
是我藏身处
祢必以得救的乐歌
四面来环绕我

PreC
主祢是生命的源头
主祢是永恒的真光
在祢圣洁的光中
我得自由必见光

C
充满我  洁净我
在祢宝座前
有生命水涌流
更新医治我
`,
`
降下你大能

V
降下祢大能  降下祢恩膏
降下祢医治在这地
降下祢大能  降下祢恩膏
降下祢医治在这地

C
降下来  降下来
降下来  在这地
降下来  降下来
降下来  在这地
`,
`
我们欢迎君王降临

V
宇宙的中心  耶稣
世界的中心  耶稣
万物都本于祢  属于祢  归于祢
祢是荣耀君王

C
我们欢迎  君王降临
渴望看见  祢的彰显
呼求祢来翻转  震动这土地
复兴我们圣洁的热情
我们欢迎  君王降临
同心高举  祢圣洁的名
呼求天窗打开  春雨不停息
我们呼喊欢迎君王降临

B
大大张口  大大充满
恩膏如雨  浇灌这地
眼未看见  耳未听见
渴慕更多  看见祢的荣面
`,
`
新耶路撒冷

V1
期待那一天
亲眼见祢面
永远不分离
在新耶路撒冷

V2
城内有一道
生命水的河
黄金的街道
有神荣耀光照

C
看哪  神的帐幕在人间
亲自与我们同在
我们作祂子民  与祂同住
看哪  神的帐幕在人间
擦去一切的眼泪
不再有伤悲  因一切都更新

B
不再有死亡  也不再有悲哀
没有哭号疼痛  以前的事都过去了
这是我渴慕  这是我等待
永永远远  与祢同作王
`,
`
配得

V1
祢背起我十架
使我因祢付的代价得自由
而如今我属祢
我要歌唱祢的良善直到永远
 
C
祢的名配得
耶稣
祢配得赞美
祢配得尊崇

V2
如今我不羞愧
我惊叹于祢无可否认的爱
祢恩典不止息
我要歌唱祢的良善直到永远

B
如今在诸天祢被高举
祢荣耀充满这地
祢配得所有赞美
祢超乎万名之名
`,
`
何等荣美的名

V1
祢就是太初神的道
至高主与神同在
在造物中隐藏祢荣耀
今显明在基督里

V2
为了与我们同享天堂
祢带着天国降临
我罪虽重但祢爱更深
我们永远不分离

C1
这是何等荣美的名  这是何等荣美的名
我王耶稣基督圣名
这是何等荣美的名  无一事物相比
这是何等荣美的名  耶稣的圣名

C2
这是何等奇妙的名  这是何等奇妙的名
我王耶稣基督圣名
这是何等奇妙的名  无一事物相比
这是何等奇妙的名  耶稣的圣名

C3
这是何等大能的名  这是何等大能的名
我王耶稣基督圣名
这是何等大能的名  无一事物相比
这是何等大能的名  耶稣的圣名

B1
死困不住祢  幔子已挪去
罪和阴间屈服于祢
与天堂欢庆  祢荣耀显明
死里复活祢得胜利

B2
祢无所匹敌  祢无人相比
耶稣掌权直到永远
国度属于祢  荣耀属于祢
超乎一切我主圣名
`,
`
永远掌权

V1
祢真好祢真好  无人能与祢相比
祢的爱祢的爱  完全向世人显明
祢是光祢是光  当黑暗向我靠近
祢是我的盼望  我的罪全都洗净

V2
祢是我的平安  当恐惧抓住我心
祢信实不改变  甚至当我远离祢
祢是我的喜乐  我歌唱单单为祢
祢赐给我生命  死亡失去了权柄

C
喔主  我奔向祢胸怀  我奔向祢胸怀
祢丰盛的大爱  永远与我同在
祢的拥抱  何等甘甜
世界真光  永远掌权

V3
有更多有更多  超过我所想所求
祢是主祢是主  万物都宣扬述说
祢在这祢在这  遮盖我所有软弱
祢是神祢是神  为祢放弃全所有

Coda
我灵歌唱  别无他名
耶稣  耶稣
`,
`
主，我邀请你

V1
让我回到那起初的爱
让我对祢忠贞专一
为我再造一颗清洁的心
让我完全属于祢

V2
让我时常回到加略山
让我不负祢的爱情
为我再次融化冰冷的心
让我全心爱慕祢

C
主我邀请祢  恭敬地邀请祢
再登上我心的宝座
主我邀请祢  衷心地邀请祢
再登上我心的宝座
`,
`
世界之光

V
耶稣  世界的盼望
唯一的真光  照亮一切黑暗
耶稣  道路真理和生命
配得至圣尊荣  到永远

C
万国万民  齐来敬拜
在圣洁的光中  高举耶稣基督的名
天上地下  齐来敬拜
愿荣耀都归祢  愿荣耀都归祢
愿荣耀都归祢  世界之光

B
哈利路亚  哈利路亚
哈利路亚  哈利路亚
`,
`
宝贵十架

V1
主耶稣  我感谢祢
祢的身体  为我而舍
带我出黑暗  进入光明国度
使我再次能看见

V2
主耶稣  我感谢祢
祢的宝血  为我而流
宝贵十架上  医治恩典涌流
使我完全得自由

C
宝贵十架的大能赐我生命
主耶稣我俯伏敬拜祢
宝贵十架的救恩是祢所立的约
祢的爱永远不会改变
`,
`
建造我生命

V1
超越我们所能传唱的一切
超越我们献上的一切赞美
超越我们口中每一个呼吸
活着为祢

V2
耶稣圣名高过世上的一切
耶稣我们生命唯一的拯救
超越我们口中每一个呼吸
活着为祢  活着为祢

C
圣洁  无人能够像祢
谁能与祢相比  开我眼看见祢作为
显明祢自己  让我贴近祢心
引导我脚步在祢爱中前行

B
建造我生命在祢爱里
这根基不会动摇
我已选择要单信靠祢
心坚定不被动摇
`,
`
为爱和合一祷告

V1
主啊  求祢怜悯医治这地
所有纷争仇恨远离这地方
求主的爱医治一切的伤口
祢是医治者  祢是真爱的源头

V2
主啊  求祢赦免我们一切软弱
赐我们一颗谦卑爱人的心
求主的爱抚平一切的伤痕
我们仰望祢  祢是和平的君王

C
遵行主教导  我们彼此相爱
只有爱能使我们合而为一
心连心手牵手  我们同心祷告
愿真爱充满每一个角落
`,
`
前来敬拜

V
哈利路亚  哈利路亚
前来敬拜永远的君王
哈利路亚  哈利路亚
大声宣告主荣耀降临

C
荣耀尊贵  能力权柄归于祢
祢是我的救主  我的救赎
荣耀尊贵  能力权柄归于祢
祢是配得  祢是配得
祢是配得我的敬拜

B
荣耀尊贵  美丽无比
神的儿子  耶稣我的主
荣耀尊贵  美丽无比
神的儿子  耶稣我的主
`,
`
你是配得

V
圣哉圣哉全地唱
昔在今在以后永在
圣哉圣哉全能神
永远在宝座上

C1
祢是配得  配得
配得尊崇和赞美
祢是配得  配得
万物敬拜祢

C2
祢是圣洁  圣洁
圣洁荣光在全地
祢是圣洁  圣洁
以圣洁妆饰敬拜祢

B
愿尊贵  荣耀  权柄和能力
都归全能神
愿各族  各方  万国和万邦
敬拜神羔羊
`,
`
盼望圣灵

V
将我眼目  聚焦于祢  喔  耶稣
将我全心  来回应祢的爱
放下恐惧  我全人降服于祢
我王  我敬拜祢

C1
主我渴慕祢同在
主我渴慕祢同在
盼望圣灵  使我更加靠近祢
生命活泉  涌流进入我心

C2
主我渴慕祢同在
主我渴慕祢同在
盼望圣灵  使我更加靠近祢
生命活泉  涌流进入我心
当我敬拜祢

B1
从我心深处  呼求祢
倾倒我全心全意赞美
从我心深处  我呼求祢
全然降服祢

B2
向祢唱出  爱的旋律
毫无保留  全然属于祢
从我心深处  我敬拜祢
主唯有祢
`,
`
认定你

V1
我要专心仰赖祢
不倚靠自己的聪明
在所行的事
都要认定祢

V2
我要专心跟随祢
不倚靠自己的能力
在所行的路
祢必指引

C1
将祢的话语系在颈项上
刻在心版上
主啊  我站立敬畏祢

C2
祢是道路真理和生命
走近祢心意
献上一切  主啊  我尊荣祢
`,
`
这世代

V1
看哪犹大狮子已得胜  众圣徒预备朝见祂
少年人看异象  老年人要作异梦
因为神的复兴将来到

V2
听到锡安的号角响起  万国万民都要颤抖
耶和华日子将到  光明将除去黑暗
因为神的复兴将来到
我们要看到神的荣耀

C
这世代我们用敬拜争战
我们用祷告改变世界
这世代圣灵要更新浇灌我们
这世代是耶稣世代
`,
`
耶稣你是中心

V1
耶稣全世界万有的主
耶稣全世界万有的主
从起初直到最后  我心的依靠
永远都是祢耶稣  耶稣

V2
耶稣我全人生命的主
耶稣我全人生命的主
从起初直到最后  生命的救主
永远都是祢耶稣  耶稣

V3
耶稣成为我教会的主
耶稣成为我教会的主
万膝都要跪拜  万口要承认
祢是救赎主耶稣  耶稣

C
我心别无所求
无人能与祢相比
耶稣祢是中心
我一切都围绕着祢  只为祢

B
从我心直到诸天  耶稣祢是唯一
我全然为祢  一切全然为祢
`,
`
坐在宝座上圣洁羔羊

V1
坐在宝座上圣洁羔羊
我们俯伏敬拜祢
昔在今在以后永在
唯有祢是全能真神

V2
坐在宝座上尊贵羔羊
我们俯伏敬拜祢
颂赞尊贵荣耀权势
都归给祢直到永远

C
万王之王  万主之主
唯有祢配得敬拜和尊崇
万王之王  万主之主
我们高举祢圣名直到永远
`,
`
我愿降服

V1
我能去哪  除了祢施恩座前
我降服于  祢十架的恩典
何等的爱  祢大能手扶持我
太荣美  何等荣美

V2
荣耀君王  祢的鞭伤能医治
神的儿子  彰显恩典真实
何等的爱  带我进入祢恩慈
真美好  祢真美好

C
我愿降服  高举祢名
耶稣  祢得荣耀
我所有和我生命
我属祢  永远属祢

B
此时此地  愿祢升起
祢得荣耀就在这里
从天堂到地极  神祢赎回我生命
我属祢  永远属祢
`,
`
大山为我挪开

V
虽然道路崎岖  困难险阻
但我心中知道  祢一直都在
不能明白为何担此重担
但我始终相信  祢一直牵着我

C
大山为我挪开  大海有路出来
我要大声宣告  耶稣  祢一直都在
祢手上的钉痕  彰显十架大爱
我要大声宣告  耶稣  祢一直都在

B
祢的话让我明白  祢爱我永不更改
祢保守我的心怀  紧握祢双手不放开
`,
`
主赐给我的所有恩典

V1
耶稣祢的爱拴住了我
灵里喜乐高声来歌唱
这希望的土地  是主所喜悦的
我要把爱奉献给祢

V2
耶稣祢的灵临格在我身
灵里喜乐高声赞美主
这神圣的土地  是主所眷顾的
我要全心来敬拜祢

C
主赐给我的所有恩典
我浑身是口说不尽
我全心跟随祢  赐我乐意的灵
把这生命奉献给祢
`,
`
十字架的传达者

V1
耶稣祢的爱拴住了我
灵里喜乐高声来歌唱
这希望的土地  是主所喜悦的
我要把爱奉献给祢

V2
耶稣祢的灵临格在我身
灵里喜乐高声赞美主
这神圣的土地  是主所眷顾的
我要全心来敬拜祢

C
主赐给我的所有恩典
我浑身是口说不尽
我全心跟随祢  赐我乐意的灵
把这生命奉献给祢
`,
`
新的异象，新的方向

V1
有敬拜的声音发出
从最高的山到海洋深处
神的儿女要唱一首新歌
我们神要做新事

V2
旧的事都已经过去
在基督里一切都要更新
新的眼界  新的异象
新的故事  新的方向

C1
全地都要渴望呼喊
荣耀的主我愿祢来
天要敞开恩膏倾倒下来
神国度的荣耀彰显

C2
全地都要渴望呼喊
荣耀的主我愿祢来
圣灵引领看见新的异象
祢要做新的事在我们中间
`,
`
万王之王

V1
在⿊暗中我们等待  没盼望  没光明
直到祢从天堂奔来  祢眼中满有怜悯
为应验律法和先知  真道出⾃童贞⼥
从⽆限荣耀宝座上  降在污秽⻢槽⾥

V2
为彰显祢国度降临  失丧的与神和好
为赎回祢所造万物  祢⽢愿承受⼗架
当祢还在苦难之中  已看⻅前⾯喜乐
定意为要拯救我们  耶稣祢舍出⽣命

V3
在祢复活的清晨  众天堂屏住呼吸
直到⽯头被挪开  羔⽺胜过了死亡
死去的圣徒复活  天使都敬畏站⽴
凡愿前来的灵魂  都回归天⽗⾝边

V4
基督的教会诞⽣  圣灵点燃了⽕焰
这亘古福⾳真理  不衰退不妥协
因为祂宝⾎圣名  我得⾃由得释放
因耶稣基督的爱  赐给我复活⽣命

C
赞美圣⽗与圣⼦
赞美圣灵三⼀神
荣耀真神⾄⾼主
赞美永归于万王之王
`,
`
愿赞美充满

V1
愿赞美充满每个家
愿喜乐充满我心
愿万物都尊崇耶稣
让我们献上祈求

V2
愿主真光照亮黑暗
愿我们屈膝敬拜
愿主荣耀充满全地
让我们同声宣扬

C
从高山上  直到山谷
颂扬赞美献给祢
从天降下  直到万民
让这歌声传千里

B
哈利路亚  哈利路亚
哈利路亚  哈利路亚
`,
`
我在这

V
我在这  是因祢恩典
我在这  是因祢慈爱
主耶稣  我如此感恩
都因祢丰盛恩典

C
感谢耶稣  耶稣
耶稣  感谢耶稣
只因着祢恩典  使我能为祢活
我赞美祢直到永远
`,
`
充满我

V
我的心惟有祢  我的灵渴慕祢
我全人献给祢  以全心赞美祢
举双手敬拜祢  深深说我爱祢
我的神我的主  我渴望亲近祢

C
充满我浇灌我  使我灵得满溢
充满我洁净我更新我
充满我滋润我  让祢爱来围绕我
我一生我一世属于祢
`,
`
前来敬拜

V
哈利路亚  哈利路亚
前来敬拜永远的君王
哈利路亚  哈利路亚
大声宣告主荣耀降临

C
荣耀尊贵  能力权柄归于祢
祢是我的救主  我的救赎
荣耀尊贵  能力权柄归于祢
祢是配得  祢是配得
祢是配得我的敬拜

B
荣耀尊贵  美丽无比
神的儿子  耶稣我的主
荣耀尊贵  美丽无比
神的儿子  耶稣我的主
`,
`
打开天窗

V1
愿我  我的祷告
如香陈列在祢面前
没有黑暗势力
可以摇动我的信心

V2
愿我  我的敬拜
到祢面前  蒙祢悦纳
天使天军屈膝
俯伏敬拜在祢宝座前

C1
打开天窗  打开天窗
愿我的祷告打开天窗
愿祢充满  祢的荣耀
祢的同在在这地

C2
打开天窗  打开天窗
愿我的敬拜打开天窗
我们只要祢的荣耀
祢的同在在这地  在这地

B
愿我的祷告如香  愿我的祷告如香
愿我的祷告如香  愿我的祷告如香
献在祢面前
`,
`
你是荣耀的君王

V1
祢是荣耀的君王
祢是和平之主
祢是天地万有主宰
惟有祢圣洁公义

V2
天使都向祢跪下
敬拜尊崇祢
因为在祢有永生之道
祢是主耶稣基督

C
和散那归于大卫的子孙
和散那归于万王之王
愿荣耀归于至高神
耶稣是弥赛亚
`,
`
完全完美我的主

V
完全完美我的主
求祢引我走公义的道路
所行的一切都为主的荣耀
都敬拜主的名

C
主我敬拜祢  主我赞美祢
唯有祢能支配我的一切
主我敬拜祢  主我赞美祢
唯有祢是配得尊贵荣耀
`,
`
带我进入幔内

V1
带我进入幔内
带我进入幔内
宝座前  与祢相见面对面
亲近祢  是何等甘甜

V2
带我进入幔内
带我进入幔内
宝座前  与祢相见面对面
敬拜祢  是何等宝贵
`,
`
荣耀大君王

V
将祢的光照亮在我们身上
让我们在祢面前毫无隐藏
打开我们的心  我要看见
祢的国度就在这里彰显

PreC
在祢光中我得见光
在祢里面有丰盛盼望
荣耀荣耀  荣耀荣耀
圣洁  大君王

C
荣耀耶稣  耶稣  耶稣  主耶稣
欢迎祢在我们中间
荣耀耶稣  耶稣  耶稣  主耶稣
祢是配得荣耀  大君王
`,
`
天国的子民

V
我们是天国的子民
我们是上帝的宝贝
我们是光明之子 神儿女
我们是天国的子民

C1
我们要彼此真诚相爱
我们要活出圣洁生命
让世人从我们身上闻到
耶稣的馨香之气

C2
我们要在主里面合一
我们要活出爱的生命
让世人看见我们就知道
我们是天国的子民

B1
我们是天国子民
我们是神的宝贝
我们是光明之子
我们是天国子民

B2
我们要彼此相爱
我们要彼此合一
我们是天国子民
`,
`
圣洁归于你

V
耶稣祢名超乎万名之名
在世上无一人能相比
耶稣所有权柄尊荣归于祢
齐宣告  让世界都知道

C
圣洁圣洁  圣洁归于祢
荣耀荣耀  归于主圣名
圣洁圣洁  圣洁归于祢圣名
万膝跪拜  还要敬拜我主

B
万国万邦  万口承认
耶稣基督是荣耀君王
万国万邦  万口承认
耶稣基督是荣耀君王
`,
`
奔跑不放弃

V
每个狂风暴雨里  祢同在在那里
每个难处低谷里  祢恩典在那里
每个伤心失望里  祢爱我爱到底
在祢爱的光中  我得着能力

C
我爱祢  用尽我全心全意全力
荣耀高举祢的名  我跟随不怀疑
我爱祢  用尽我全心全意全力
在这爱的路程里  我奔跑不放弃

B
四面受敌  却不被困住
心里作难  却不至失望
至暂至轻的苦楚要成就
极重无比永远的荣耀
`,
`
主你是我力量

V
我的诗歌  我的拯救
祢是我患难中随时的帮助
众山怎样围绕耶路撒冷
祢必围绕我到永远

C
主祢是我力量  主祢是我高台
坚固磐石我信靠祢必不动摇
主祢是我力量  主祢是避难所
我的盼望只在乎祢
`,
`
复兴圣洁

V
主  求祢复兴我  心中的圣洁
为我造清洁的心  使我重新有正直的灵
主  求祢复兴我  心中的圣洁
将我分别为圣  作祢尊贵荣耀器皿

C1
我将身体献上当作活祭
一生作祢圣洁的器皿
我将生命献上为祢而活
为祢呼吸

C2
我将身体献上当作活祭
一生作祢圣洁的器皿
一生传扬基督的圣名
`,
`
当你找到我

V
当祢找到我  在生命十字路口
祢靠近我  祢拥抱我  从此祢不放手
过去的种种  全然交在祢手中
祢医治我  祢恢复我  从此我不放手

PreC
夜再黑  心再疲惫  我仰望祢至圣荣面
我已决定永不后退
祢作为  何等荣美  祢大能在我心间
我愿一生紧紧跟随

C1
我跟随祢  从高山到低谷
我跟随祢  即使荆棘满布
纵然面对挑战  也有眼泪  感到疲惫
我要挣脱缠累  永远不后悔

C2
在祢翅膀荫下  我得保护
祢话语使我  生命得坚固
祢应许不摇动  自始至终  永不落空
未来在祢的手中  我不忘初衷
`,
`
如今我信靠

V
被击倒却不羞愧  被攻击却仍跟随
祢有足够恩典  祢有足够恩典
被试炼却不跌倒  被孤立却不动摇
我宣扬祢真好  我宣扬祢真好

C
如今我信靠  盼望中知道
我神  永远都不动摇
神与我同在  祂全然得胜
我神  永远都不动摇

B
祢开始就必成就  我刚强在祢爱中
祢名稳妥
祢为我们争战  盼望永远不失落
在祢手中
`,
`
愿你荣耀遍及全地

V1
让我歌唱  来赞美祢名
举起我的双手敬拜祢
愿祢荣耀遍及全地

V2
更新我灵  渴慕祢圣灵
放下我的所有荣耀祢
哈利路亚  哈利路亚

C1
在万民中称谢祢
在万族中歌颂祢
因祢慈爱伟大
祢的信实高及诸天

C2
在万民中称谢祢
在万族中歌颂祢
神啊  愿祢被尊崇
愿祢荣耀遍及全地
`,
`
神的信实良善

V1
主我爱祢  祢的怜悯永不改变
每一天  祢的恩手扶持我
清晨当我睁开双眼  直到我躺卧
我要歌唱  神的良善荣美

V2
祢的声音  领我经过水火试炼
黑暗中  如此亲近我的灵
祢是我的天父  祢是我良友
一生活在  祢的良善荣美

C
一生信实对我顾念
一生美好待我  到永远
一切所有生命气息
要歌唱  神的良善荣美

B
祢良善永看顾我  永伴随我生命
祢良善永看顾我  永伴随我生命
当我降服祢  我献上生命  所有全属于祢
祢良善永看顾我  永伴随我生命
`,
`
将天敞开

V
将天敞开  祢的荣耀降下来
将天敞开  祢的同在降下来
将天敞开  祢的荣耀降下来
万国赞叹祢  祢是荣耀君王

C
天上地下  合一敬拜
欢呼耶稣基督圣洁羔羊  荣耀归于祢
天上地下  在永恒里敬拜
哈利路亚  哈利路亚

B
神就在这里  我们欢迎祢
让一切焦点转向祢
神就在这里  我们欢迎祢
宝座前敬拜不停息
`,
`
我要一心称谢你

V
我要一心称谢祢
在诸神面前歌颂祢
我要向祢的圣殿下拜
为祢慈爱和诚实称赞祢名

C1
我要歌颂耶和华作为
因祢慈爱永远长存
我虽行在困苦患难中
祢应许必将我救活

C2
我要歌颂耶和华作为
因祢的名大有荣耀
我呼求时祢必应允我
鼓励我使我心里有能力

Coda
祢必成全关乎我的事
祢必不离弃祢手所创造的
`,
`
唯有耶稣

V
耶稣祢能  使瞎眼看见
耶稣祢能  医治伤心人
耶稣祢有  权柄释放
叫不可能变为可能

C
唯有耶稣掌管天地万有
唯有耶稣能使水变成酒
叫狂风巨浪平息  大能赦罪行神迹
耶稣无人与祢相比
`,
`
惟有基督

V1
惟有基督是我盼望
是我光明 力量 颂赞
历经荒漠风暴锤炼
坚如磐石  是我倚靠

C1
慈爱至高  平安至深
驱散恐惧  平息风浪
我的安慰  我的一切
在基督爱里我站立

V2
惟有基督道成肉身
全权之神成为婴孩
从天赐下慈爱公义
受尽凌辱为救世人

C2
主在十架  舍身受死
将神忿怒全然挽回
我的罪孽祂全承担
因基督之死我得生

V3
救主舍身  受死埋葬
黑暗掩面世界之光
荣耀之日  冲破幽暗
脱离死亡  救主复活

C3
荣耀救主  全然得胜
从罪恶中将我释放
我在主里  主在我里
蒙基督宝血我得赎

V4
无论生死  坦然无惧
生命满载基督能力
一生一世  无时无处
基督掌管人生道路

C4
阴间权势  恶人技俩
无法将我与祂隔绝
直到主来  或召我去
靠基督能力我坚立
`,
`
在呼召我之处

V1
主温柔的圣灵  让我全心感受
渗透我的生命  赐下平静和安息
祢使我心得满足

V2
主慈爱的真理  祢荣光照向我
包围我的身体  赐下平静和安息
让我感受祢的爱

C
在呼召我之处  我要献上敬拜
无论遭遇何事  依然扬声歌唱

B
在我行走时成为我道路
活着时成为我生命
就在这地  献上敬拜
`,
`
求圣灵运行

V
在这时刻求圣灵运行
来充满我们的心
改变我们  让我们更像祢
让我们把自己完全献给祢

C1
噢 主圣灵  噢 主圣灵
充满在这里
叫我们的灵
能在祢光中  再一次兴起

C2
噢 主圣灵  噢 主圣灵
充满在这里
来充满我们的心
让我们明白祢所有旨意
`,
`
恩友歌

V1
何等恩友慈仁救主
负我罪孽担我忧
何等权利能将万事
来到耶稣座前求

C1
多少平安我们坐失
多少痛苦冤枉受
都是因为未将万事
来到耶稣座前求

V2
我们有无试探引诱
有无难过苦关头
决不应当因此灰心
仍当到主座前求

C2
何处能寻这般良友
同尝一切苦与愁
我们弱点主都知道
放心到主座前求

V3
我们是否软弱多愁
千斤重担压肩头
主仍做我避难处所
奔向耶稣座前求

C3
你若真逢友叛亲离
好向耶稣座前求
到祂怀中祂必保护
有祂安慰便无忧
`,
`
你配得全所有

V
众圣徒众天使  俯伏宝座前
众长老谦卑
卸下冠冕在神羔羊前敬拜

C
祢配得全所有  祢配得全所有
祢是万物源头  一切都归于祢
配得所有荣耀
`,
`
凡事都能做

V
信是未曾看见
依然仰望十架
信是完全交托
深知主已掌权

C
我靠着那加给我力量的  凡事都能做
或风浪或低谷  主平安在我心
我靠着那加给我力量的  凡事都能做
行在主的旨意  我凡事都能做
`,
`
诗篇二十三篇（生命河灵粮堂）

V1
耶和华是我的牧者  我必不致缺乏
祂使我躺卧青草地上
领我在可安歇的水边

C1
祂使我的灵魂苏醒  使我灵魂苏醒
为自己的名引导我走义路
引导我走义路

V2
我虽然行过死荫幽谷  也不怕遭害
因为祢与我同在
祢的杖和竿都安慰我

C2
在我敌人面前祢为我摆设筵席
祢用油膏了我的头  使我福杯满溢

C3
我一生一世必有恩惠慈爱随着我
我且要住在耶和华的殿中
直到永永远远
`,
`
这是圣洁之地

V
这是圣洁之地  神在这里
前来献上最深的敬拜
这是圣洁之地  神在这里
设立宝座  在荣耀的敬拜里

C
我全心来敬拜祢主  高举双手敬拜祢主
在祢大能荣耀光中  我俯伏在祢宝座前
我全心来敬拜祢主  高举双手敬拜祢主
在祢大能荣耀光中
我与众天使俯伏 深深敬拜祢
`,
`
我神真伟大

V1
尊贵荣耀君王  在全地之上
愿万民都喜乐  全地都喜乐
主祢满有荣光  黑暗都躲藏
万民高声唱  齐来高声唱

V2
昔在永在君王  从今直到永远
祢从不曾改变  永存在天地间
祢是三一真神  父子与圣灵
真神的羔羊  全能神羔羊

C
我神  真伟大
歌颂祢圣名  真伟大
全地都看见  我神  真伟大

B
祢至圣尊名  配受大赞美
全心歌颂  我神  真伟大
`,
`
恩典之流

V
主圣灵  轻轻呼唤着我的姓名
黑暗中  祢爱牵引着我
喔我神  我的心单单渴慕敬拜祢
天使围绕  带领我看见祢

C1
十架上担当我罪和羞愧
忍受鞭伤交换我生命
恩典之流  恢复我得洁净
与我同在  使我坚定

C2
主的爱穿越高山直到地极
赐下恩惠阳光在这地
恩典之流  敬畏中我站立
慈爱怜悯  淹没我的心

E
此生充满主恩典  因祢宝血信实完全
我渴望见祢荣面  述说祢奇妙荣美
`,
`
神羔羊

V
主啊 我来到祢宝座前  我心向祢敬拜
在玻璃海我要敬拜  俯伏在祢圣洁中
主啊 我来到祢宝座前  全人向祢跪拜
愿尊贵 荣耀和感谢  都归宝座被杀羔羊

C
神羔羊  医治者
赦我罪  赐自由
神羔羊  医治者
我的心称颂
`,
`
你是圣洁

V
耶稣祢是何等圣洁美丽
万人中无人能与祢相比
耶稣祢是永恒明亮晨星
荣耀尊贵  再来君王

C
主 祢是圣洁  配得一切尊崇与赞美
永远尊贵  永远荣美  我们谦卑俯伏敬拜
主 祢是圣洁  从永远到永远不改变
何等尊贵  何等荣美  我们谦卑俯伏敬拜

Coda
圣洁真神  祢荣耀充满在全地
`,
`
我要爱慕你

V
耶稣  我要爱慕祢
我要爱慕祢  倾倒我的生命
祢是  我唯一所求
让我心单单渴慕祢

C
我心满溢  我心满溢
对祢的爱和思念无止尽
让我走向祢的身旁贴近祢
主啊 我渴慕寻求祢
`,
`
满有能力

V
我的盼望  就在耶稣基督里
在祢里面  满有平安
生命泉源  就在耶稣基督里
有主在我里面活着

C
我宣告在我里面的  比世上一切更有能力
我不属这世界  我高举耶稣的名
我宣告在我里面有  活水涌流满有能力
有耶稣在我里面活着  我勇敢站立

B
有主在我里面  没有惧怕能战胜仇敌
有主在我里面  没有惧怕还得胜有余
`,
`
生命在于你

V
生命在于祢主
力量在于祢主
盼望在于祢主
在祢 在于祢

C
我要以生命来赞美祢
我要尽全力来赞美祢
全心赞美祢  全力赞美祢
我的盼望在于祢
`,
`
你真好

V
祢慈爱  使我回转向祢
祢良善  吸引我靠近
祢怜悯  呼召我更像祢
祢恩典  满足我心

PreC
在每一天  唤醒我灵赞美
用我全心  来歌唱

C
祢真好  祢真好  祢真好
祢怜悯直到永远

B
祢慈爱直到永远  祢良善直到永远
祢怜悯直到永远  到永远
`,
`
医治我

V
压伤的芦苇祂不折断
将残的蜡烛祂不吹熄
一生的年岁在祂手里
平安喜乐都陪伴我
平安喜乐都陪伴我

C
医治我  我必得痊愈
万军之耶和华  全能的主
医治我  我必得痊愈
如鹰展翅上腾  奔跑走天路
`,
`
活祭

V
主我是一个活祭
我不再属于自己
甘心乐意献给祢
一生一世永属祢

PreC
我的生命  每个气息
全是祢所赐予
财富能力  血汗热情
理当献上归祢  哦

C
膏我 用我  从天降下火
愿祢悦纳  献上的所有
膏我 用我  从天降下火
愿祢悦纳  献上的所有
`,
`
无人能与你相比

V1
永活全能的主宰
道成肉身显明祢的爱
奇妙主  荣耀神
何等的伟大

V2
圣洁尊贵的君王
超乎万名在全地之上
为我罪  流宝血
赎回我生命

PreC
无人能与祢相比
祢掌权直到永远
我要扬声赞美祢

C1
喔  何等伟大的爱
高过诸天深海
当受极大赞美  喔

C2
喔  主祢满有能力
世界盼望是祢
我要敬拜祢  耶稣我的主
`,
`
这是耶和华所定日子

V
这是耶和华所定日子
神的儿女当欢呼喜乐
耶和华已战胜仇敌  战胜仇敌
全地大声欢呼

C
耶和华是我力量  我心中一切的盼望
耶和华是我的诗歌  又是我的拯救
神子民行走全地  报好消息宣告祢的名
高举得胜的旌旗  我们称谢祢  祢是我神
`,
`
何等爱你

V1
何等爱祢 阿爸天父
祢无条件为我付出
牺牲爱子叫我得赎
祢爱充满我

V2
主祢宝血为我而流
洗净我罪给我自由
祢的爱是何等伟大
喔喔  主耶稣

C
一生要赞美  我美好救主
祢的爱是我生命全部
一生要敬拜  我亲爱天父
祢无条件的爱让我心得满足
`,
`
圣洁和荣耀

V1
荣耀  喔荣耀
等候祢荣耀降临
俯伏  放下我的冠冕
从心底深处敬拜祢

V2
圣洁  喔圣洁
渴慕祢圣洁降临
触摸  充满祢的子民
我们受造为敬拜祢

C
圣洁和荣耀
不停献上  都归真神羔羊
颂赞和爱戴
都归耶稣  永恒君王

B
荣耀都归祢  能力都归祢
耶稣  祢名超过世上的万名
天上和地下  所有受造的
都要俯伏敬拜荣耀祢
`,
];

for (var i = 0; i < lyricsLibrary.length; i++) {
    lyricsLibrary[i] = lyricsLibrary[i].trim();
}
