var lyricsLibrary = [
`
你真伟大

V1
主啊我神  我每逢举目观看
祢手所造一切奇妙大工
看见星宿  又听到隆隆雷声
祢的大能遍满了宇宙中

V2
当我想到  神竟愿差祂儿子
降世舍命  我几乎不领会
主在十架  甘愿背我的重担
流血舍身为要赦免我罪

V3
当主再来  欢呼声响彻天空
何等喜乐  主接我回天家
我要跪下  谦恭地崇拜敬奉
并要颂扬  神啊 祢真伟大

C
我灵歌唱  赞美救主我神
祢真伟大  何等伟大
我灵歌唱  赞美救主我神
祢真伟大  何等伟大
`,
`
永活盼望

V1_1
我无法跨过  如此的深渊
我无法翻越  如此高山
在绝望之中  我仰望天堂
祢的圣名  夜空回荡

V1_2
在黑暗之中  祢恩典慈爱
撕裂我灵里的霾
这工已完成  无人可撼动
耶稣是永活盼望

V2_1
谁人能想象  如此的怜悯
何心可测度  如此恩惠
至高的天父  舍弃祂荣光
担当我罪孽和羞愧

V2_2
十架上宣告  我罪得赦免
万王之王已赎我
荣耀的救主  生命的归属
耶稣是永活盼望

C
哈利路亚  救主今已释放我
哈利路亚  死亡无法操控我
祢已挣断这枷锁  救恩之名临到我
耶稣是永活盼望

B1
清晨已来临  显明祢应许
墓中的身体  开始复兴
如雄狮苏醒  打破这沉寂
宣告死亡已失去权力

B2
清晨已来临  显明祢应许
墓中的身体  开始复兴
如雄狮苏醒  打破这沉寂
耶稣是完全的胜利
`,
`
主的喜乐是我力量

V
主的喜乐是我力量
祢的救恩是我盼望
虽然橄榄树不效力  也许葡萄树不结果
我仍因救我的神欢欣快乐

C1
我要赞美
无论得时或不得时
我要赞美
每天从日出到日落

C2
我心坚定于祢  每天赞美不停
我要赞美  跳舞赞美
我要赞美  自由赞美
大声欢呼  祢是永远得胜君王
`,
`
只要耶稣

V1
每个白天和黑夜
渴望来到主面前
心中唯一的思念
只要耶稣

V2
当我安静在主前
当我安静在主前
心中唯一的思念
只要耶稣

C
只要耶稣
只要耶稣
拿走我的世界
只要耶稣
`,
`
在你没有难成的事

V
芥菜种的信心  可以将大山挪开
相信神的应许  可以跨越困难
信心的祷告  神都听见
大声地宣告  勇敢向前

C
在祢没有  没有难成的事
软弱和忧虑中  祢不曾放弃我
祢的应许 应许  不论有多少
在基督里都是阿们
`,
`
遇见你

V1
当我遇见祢  使我夜间歌唱
超越一切环境  看见祢的同在
我的心欢喜  我的灵快乐
我全人安然居住

V2
祢是我至宝  我最深的喜悦
全心仰望倚靠  我便不致动摇
祢与我同行  祢爱我到底
这一生有祢真好

C1
在祢面前有满足的喜乐
在祢右手中有永远的福乐
量给我的地界  坐落佳美之处
我的产业实在美好

C2
在祢面前有满足的喜乐
在祢右手中有永远的福乐
祢是我的主  好处不在祢以外
遇见祢  我就遇见幸福
`,
`
无尽的爱

V1
听见祢温柔声音
挪去我所有恐惧
黑暗中祢呼唤我走向祢
敞开我心

V2
过去我风闻有祢
如今却亲眼见祢
我决定不再倚靠我自己
一生只为祢

Pc
在我身旁没离开过
不停守候着我

C1
祢无尽的爱拥抱我
虽跌倒软弱仍爱我
在祢眼中看见真实的我
放我自由

C2
祢牺牲的爱拯救我
用钉痕述说不放手
在祢眼中看见真实的我
放我自由
`,
`
我选择喜乐

V1
我来到神面前
最喜乐神面前
弹琴跳舞大声欢呼

V2
我来到神面前
最喜乐神面前
有了祢我就喜乐

C1
我选择喜乐喜乐喜乐喜乐
靠主常常喜乐
我选择喜乐喜乐喜乐
神在这里喜乐无止尽

C2
我选择相信相信相信相信
祷告凡事谢恩
我选择相信相信相信
凡事感恩凡事相信
`,
`
我需要有你在我生命中

V1
哦主 求祢保守我的心我的意念
使我 能够遵行祢旨意
我愿将祢话语深藏在我心
作路上的光  成为我脚前的灯

V2
哦主 求祢坚固我信心我的力量
使我 得以勇敢向前行
因我知道有时我仍会软弱
求祢带领我 使我不会再退缩

C
我需要有祢在我生命中
好让我一生能学祢的样式
使我能成为祢所喜悦的儿女
使我的生命能够彰显祢荣耀
`,
`
我是你所造

V1
我的肺腑是祢所造
在母腹中祢已覆庇我
我的受造奇妙可畏
祢的作为我心深知道

V2
我在暗中受造  被联络
未成形的体质祢已看见
我的日子是祢所定
尚未度一日  已写在祢的册上

C
祢的意念向我何等宝贵
其数比海沙更多
求祢鉴查我  试炼我
引导我走永生的道路
`,
`
我们呼求

V1
主  我们同心在祢面前
以祷告寻求祢面
我们转离所有的恶行
定意单单跟随祢

V2
主  我们是属祢的子民
求赐下父神的心
我们要回转向祢父神
也要看见复兴

V3
主 我们国家是属于祢
求祢来掌管全地
愿祢来怜悯医治这地
荣耀再次降临

C1
我们呼求祢阿爸父
设立祢宝座在这地
祢必睁眼看侧耳垂听
奉主名的呼求

C2
万民都要来敬拜祢
荣耀高举祢的圣名
复兴这地  全能的君王
我们欢迎祢
`,
`
圣灵请你来充满我心

V
圣灵请祢来充满我心
我需要祢恩膏充满我灵
圣灵啊我好爱祢  我的灵让祢牵引
而每一天  我要更深爱祢

C
我要追求祢主  我将生命献给祢
牵引我更亲近祢  祢大能更新我灵
无人能与祢相比  主我仰望祢的荣面
我敬拜祢在灵与真理里
`,
`
圣灵请你来

V
圣灵请祢来  充满在这地
我渴望更认识祢  更深的经历
圣灵请祢来  改变我心意
开我眼睛 开我耳  让我更多认识祢

C
我呼求圣洁  圣洁
圣洁归我主
我尊崇祢荣耀  荣耀
荣耀归我主
`,
`
荣耀至高神

V
圣洁尊贵全能神  祢国度降临这地
荣耀得胜大君王  祢荣美无人能及
耶稣基督神爱子  全地都向祢跪拜
父子圣灵三一神  祢宝座存到永远

C1
荣耀至高神  配得尊崇敬拜
祢名超乎万名之上
诸天述说祢的荣耀
穹苍传扬祢的手段

C2
荣耀的君王  配得所有赞美
凡有气息都要歌颂
尊贵荣耀能力权柄
都归荣耀至高真神

B1
至圣至荣  可颂可畏
全能三一神
昔在今在  以后永在
全地都颂赞

B2
万膝跪拜  万口承认
耶稣至高神
万王之王  万王之王
作王到永远
`,
`
让我得见你的荣面

V
我的灵安静在祢面前
深知道祢就在这里
我的灵降服在祢面前
知道祢是我的神

C1
让我得见祢的荣面
彰显祢心意使我看见
我要在这里见到祢
定意要见祢的荣耀

C2
让我得见祢的荣面
回应祢心意与祢相连
我要在这里敬拜祢
定意要见祢的荣耀

B
荣耀同在充满在这里
羔羊宝座设立在这里
`,
`
你坐着为王

V
主耶和华  满有怜悯和恩典
我投靠在祢翅膀荫下
当我回转  一宿虽然有哭泣
早晨必欢呼喜乐

C
祢坐着为王  到永永远远
虽洪水翻腾  我坚定仰望祢
祢坐着为王  垂听我呼求
使我灵苏醒  有复活的生命
`,
`
顺服

V
当我不明白  事情的由来
信心不足的时候  求主帮助
生命在於祢  万事皆属祢
信心动摇的时候  我要信靠

C
我相信祢的意念  高过我的意念
万事互相效力  叫爱神的人得益处
我相信祢的道路  高过我的道路
我甘愿谦卑  顺服

Coda
我相信祢的应许  倚靠祢的恩典
我甘愿谦卑  顺服
`,
`
你眼目必看顾这地

V1
大声敬拜  全心呼喊
全能的神愿祢降临
慈爱双手  大能膀臂
直到如今仍行神迹

V2
敬拜声音  充满圈地
高举双手荣耀归祢
专心谨守  祢的话语
世世代代都不偏离

C1
祢眼目必看顾这地
眷顾祢的儿女
祢必照所应许的成就

C2
祢眼目必看顾这地
聆听我们声音
祷告盼望  荣耀复兴这地

B1
使我们得饱足
新酒和油满溢
祢定意要赐福这地

B2
遵行祢的旨意
谦卑回转向祢
我们定意要跟随祢
`,
`
紧紧抓住你

V
我无助的时候  祢给我力量
我害怕的时候  祢紧紧抱住我
当我觉的我不行  祢告诉我可以
祢就是那最爱我的主

C1
我紧紧抓住祢
我永远不放手
我看到祢独生子
为我钉死在十架上

C2
我紧紧抓住祢
我永远不放手
是祢医治了我
是祢从未离开过我

Coda
我已看到我的未来
是充满信心和盼望
`,
`
爱中相遇

V1
每一天  渴望与祢在爱中相遇
再一次  将自己完全地献给祢
唯有祢  是我的喜乐和力量
我甘愿舍弃一切跟随祢

V2
每一天  渴望与祢在爱中相遇
再一次  降服在祢大能荣耀里
唯有祢  是我的良人和恩友
我愿意一生敬拜荣耀祢

C
将我全人献上当作活祭
以清洁的心单单事奉祢
愿祢旨意成全在我的生命里
求圣灵更新  掌管我一生

B
洁净我  吸引我  快跑跟随祢
在爱中遇见祢
洁净我  吸引我  快跑跟随祢
荣耀中敬拜祢
`,
`
坚强的爱

1
无论或死或生或天使
执政掌权现在或将来
或高处低处任何受造物
都不能将我与祢爱隔绝

2
Oh oh oh...
Oh oh oh...

3
主祢的爱情  刻在我心版上
众水不能熄灭  海不能淹没
主祢的爱情  坚强胜过死亡
都不能将我与祢爱隔绝

4_1
我知道故事结局
我终将从旷野出来
是靠着我心所爱

4_2
我知道故事结局
我终将从旷野出来

5
祢爱最高  祢爱最宽广
祢爱最深  祢爱无止尽

6
Your strong love
Your strong love
It is your strong love
Your strong love
`,
`
十字架

V
耶稣背负十架  为我担当过犯
毫无保留为我  舍命在十架上
祢受鞭伤  我得医治
祢受刑罚  我得自由释放

C
十字架 十字架  耶稣以爱覆盖我
十字架 十字架  祢宝血为我流下
十字架 十字架  我得救赎的记号
十字架 十字架  是我永远的荣耀

B
十字架 十字架  永是我的荣耀
我众罪都洗清洁  唯靠耶稣宝血
`,
`
深深爱你

V
我生命中最渴望的一件事
切慕祢  单单寻求祢
用我全心全意  用我全力爱祢
敬拜祢  让祢荣耀充满全地

C
深深爱祢 耶稣  深深爱祢 耶稣
我爱祢  超越生命中一切
深深爱祢 耶稣  深深爱祢 耶稣
哦 我爱祢  耶稣
`,
`
三天之后

V
耶稣  亲手扛下人的软弱
独自  将所有的罪都承受
宝血  一滴滴将地染深红
为赎回我而流

C_1
失败钉十架上  羞愧钉十架上
绝望钉十架上  救赎在各各他
疾病钉十架上  创伤钉十架上
过去钉十架上  救赎在各各他

C_2
罪恶钉十架上  骄傲钉十架上
破碎钉十架上  全都与祢埋葬
把全部钉十架上  把全部钉十架上
把一切钉十架上  全都与祢埋葬

B
三天之后祢复活
仇敌计谋都落空
万民近前来歌颂
喔 全能神 救赎主 基督
`,
`
交托我忧愁

V_1
我交托我的忧愁
我交托我的羞辱
完全交托
祢喜乐充满我

V_2
我交托我的疾病
我交托我痛苦
完全交托
祢喜乐充满我

C
Yes Lord Yes Lord Yes Yes Lord
Yes Lord Yes Lord Yes Yes Lord Yes Lord
Yes Lord Yes Yes Lord Amen
`,
`
有一道河

V1
有一道河  这河的分汊
使神的城欢喜
有一道河  从宝座流出
带来医治生命

V2
这一道河  它所到之处
万物生生不息
神的江河  就在这里
赐下生命能力

C1
能使瞎眼重见光明
聋子听主声音
瘸腿者起来行走
受压制的得自由

C2
主赐华冠代替灰尘
喜乐油代替悲哀
赞美衣代替忧伤的灵
为荣耀神的名
`,
`
我主何等伟大

V_1
我的主我的神  创造宇宙和万物
我主何等伟大
从永远到永远  诸天宣扬造物主
我主何等伟大

V_2
祂的名至高 祂的国度直到永远
祂爱世人赐下独生子
宝血流出  为我受死为我复活
我主何等伟大

C
我主何等伟大
掌权直到永远
智慧能力无边
我主何等伟大
`,
`
你们要赞美耶和华（沙龙音乐事工）

V
你们要赞美耶和华
在高处赞美祂
众使者要赞美祂
诸军都要赞美祂

C1
日月都要赞美祂
放光的星宿要赞美祂
那天上的天和天上的水
都要来赞美祂

C2
赞美耶和华的名
因祂一吩咐就造成
祂的荣耀在天地之上
直到永永远远
`,
`
这世代要呼求你

V1
主  我属于祢
求祢差遣  我就跟随
祢说话  我就顺服
勇敢爱祢所爱的

V2
我们属于祢
求主开启  我们眼睛
每世代  向祢呼求
祢教我如何争战

Pc
让我们不分彼此
众教会同心呼求

C1
这世代要呼求祢
呼求祢的爱降临
高举起代祷双手
我们心与祢合一

C2
这世代要呼求祢
呼求祢的爱降临
破口中勇敢站立
祢旨意成就这地

B
紧紧跟随  紧紧跟随
紧紧跟随祢心意
永不放弃  永不放弃
直到祢的国降临
`,
`
超乎万名之名

V
我的力量我的救赎主
我要爱祢到永远

Pc
凡等候祢
盼望于祢的  必不致羞愧
祢就是那最坚固的磐石

C
祢圣名超乎一切其他的名

B
哈利路亚  哈利路亚
哈利路亚  哈利路亚
`,
`
我的心你要称颂耶和华

V_1
我的心  你要称颂耶和华
不可忘记祂的恩惠
祂赦免你一切过犯罪孽
医治你疾病复原

V_2
我的心  你要称颂耶和华
不可忘记祂的恩惠
祂以仁爱慈悲为你冠冕
为受屈的人申冤

C_1
天离地有何等的高
祂的慈爱也何等的深
东离西有多么的远
祂使我的过犯也离我多远

C_2
耶和华有怜悯的爱
且有丰盛无尽的恩典
从亘古直到永远
耶和华祂是我的神
`,
`
主你真伟大

C_1
主祢真伟大
How awesome You are  
主祢真伟大
How awesome You are
深深爱我  捧我在祢手心中

C_2
主祢真伟大
How awesome You are  
主祢真伟大
How awesome You are
永恒的主  唯一的主上帝

V_1
伟大奇妙神  宇宙创造主
在祢眼里  万国只像小水滴
无人与祢相比

V_2
伟大奇妙神  宇宙创造主
创世之前  为我定完美计画
我一生敬拜祢
`,
`
阿爸阿爸父

V_1
阿爸阿爸父  阿爸阿爸父
紧紧拥抱我  深深注视
我的阿爸阿爸父

V_2
阿爸阿爸父  阿爸阿爸父
时常帮助我  并赐力量的阿爸父

C
医治忧伤破碎的心灵
缠裹无法忍受的伤痛
因祂认识我  因祂深切了解我
祂使我的灵魂重新得力
`,
`
展开清晨的翅膀

V
主耶和华  祢已经鉴察了我
我坐下  我起来  祢都已晓得
我行路  我躺卧  祢都细察
祢也深知我一切所行

Pc
我舌头上的话  祢没有一句不知道
祢在我前后环绕着我  按手在我身上
这样的奇妙  是我不能测透
祢的至高祢的尊贵  是我永远不能所及

C
我可以往哪里去躲避祢的灵
我可以往哪里去逃  可躲避祢的面
我若展开清晨的翅膀飞到地极
就在那里  祢的双手  也必引导我
`,
`
谢谢你

V
我能用什么报答祢恩典
世上的一切  无法换取祢的爱
白白地得来  无止尽赦免
尽在宝血和十架

C1
谢谢祢洗净我的罪
谢谢祢医治我伤悲
谢谢祢擦干我的眼泪
挪去后悔  释放我的缠累

C2
谢谢祢洗净我的罪
谢谢祢医治我伤悲
谢谢祢用生命将我赎回
我是天父永远最爱宝贝
`,
`
恩典已降临

V
将软弱变为刚强  贫穷成为富足
瞎眼得看见  哀哭变为跳舞
一切山洼都填满  崎岖成为平原
在神里面充满无限可能

Pc
祢的能力覆庇我
战胜试炼和艰难
我相信
祢的恩典完全够我用

C
神的恩典已降临  喜乐充满我们中间
在恩典深处  重担都变为轻省
神的恩典已降临  喜乐充满我们中间
倚靠全能神  没有难成就的事
`,
`
耶稣爱我我知道

V1
耶稣爱我我知道
因有圣经告诉我
幼小孩童祂牧养
他们软弱主刚强

V2
耶稣爱我永不变
虽我软弱多疾病
从今离罪得释放
因主钉死十架上

V3
耶稣爱我舍生命 
将我罪恶洗干净
天堂恩门为我开 
让祂小孩走进来

V4
耶稣爱我到永远
一生道路主陪伴
主既为我罪舍命
活着愿荣耀主名

C
主耶稣爱我
主耶稣爱我
主耶稣爱我
因圣经告诉我
`,
`
你真配得赞美

V
太阳不足彰显祢的光辉
蓝天装不下祢的意念
繁星数不尽祢的恩典
群山无以表明祢威严

C
哦 耶稣  祢真配得赞美
哦 耶稣  唯祢配受敬畏
谁能述说祢无比的荣美
谁能测度祢无限的智慧

B
诸天述说祢的荣耀
穹苍传扬祢的作为
`,
`
我知谁掌管明天v2

V1
我不知明日将如何  每时刻安然度过
我不求明天的阳光  因明天或转阴暗
我不为将来而忧虑  因我知主所应许
今天我必与主同行  祂深知前途光景

V2
我不知明日将如何  或遭遇贫苦饥饿
那看顾麻雀的恩主  必随我时刻看顾
我前程虽经历水火  或快乐或有灾祸
但我主引导我路途  祂宝血将我涂抹

C1
许多事明天将临到  许多事难以明了
但我知主掌握明天  祂必要领我向前
`,
`
平安夜

V1
平安夜  圣善夜
万暗中  光华射
照着圣母也照着圣婴
多少慈祥也多少天真
静享天赐安眠  静享天赐安眠

V2
平安夜  圣善夜
牧羊人  在旷野
忽然看见了天上光华
听见天军唱哈利路亚
救主今夜降生  救主今夜降生

V3
平安夜  圣善夜
神子爱  光皎洁
救赎宏恩的黎明来到
圣容发出来荣光普照
耶稣我主降生  耶稣我主降生
`,
`
在至高之处

V
在至高之处  我献上感恩
在至高之处  我举手敬拜
天使天军同声赞美耶稣
最大的荣耀  都归于祢

C
在至高之处荣耀归与神
在地上平安归与祂所喜悦的人
哈利路亚  哈利路亚
祢配得最大的荣耀
`,
`
我们高举耶稣的名

V1
大能的君王  尊贵的君王
我们敬拜祢  尊崇荣耀祢

V2
大能的君王  尊贵的君王
与天使齐声  高举祢的名

C
我们高举  高举祢的名
我们高举  荣耀的君王
尊贵  荣耀  颂赞  能力
我们高举耶稣的名

B
祢是世界的拯救
祢是得胜的君王
祢是明亮的晨星
祢的国度没有穷尽
`,
`
荣耀歌

V1
天使歌唱在高天  美妙歌声遍平原
四周山岭发回声  响应天使欢乐音

V2
牧人有何大喜悦  快乐歌声不休歇
有何喜讯感心弦  齐发歌声美难言

V3
请君同往伯利恒  天使所唱圣婴生
前来跪拜同声唱  基督救主新生王

C
荣耀 荣耀 荣耀 归真神
荣耀归于真神
荣耀 荣耀 荣耀 归真神
荣耀归于至高真神
`,
`
齐来崇拜歌

V1
齐来  宗主信徒  快乐又欢欣
齐来  一齐来  大家上伯利恒
来朝见圣婴  天使王已降生

V2
由上主的上主  光明的光明
虚心并不嫌  童真女胎中生
真主的真主  是生成非造成

V3
天使结成乐队  欢然同歌唱
光明众天军  来高声同赞扬
至高的处所  荣耀归于君王

C
齐来虔诚同崇拜
齐来虔诚同崇拜
齐来虔诚同崇拜
主基督
`,
`
永远不分离

V
我要像一棵树按时结果  栽在溪水旁
喜爱祢的话语  昼夜思想  这是有福的
祢就像葡萄树  我是枝子  常在祢里面
爱我疼我的天父  我是祢孩子

C
永远不分离  哦 永远不分离
世上没有任何事能使祢爱隔绝
永远不分离  哦 永远不分离
留心听祢  侧耳听祢  我是有福的

Coda
像一棵树永不枯干
常在祢里面
`,
`
你真配得荣耀

V
祢真配得荣耀
配得尊贵
主我举双手敬拜祢
我要尊崇祢圣名

C
祢本为大
祢行伟大的神迹
无人能与祢相比
无人能与祢相比
`,
`
耶和华行了大事

V1
耶和华已经为我们行了大事
祂铺张云彩当遮盖  夜间使火光照
耶和华已经为我们行了大事
祂在干旱之处使水流成河

V2
耶和华已经为我们行了大事
祂命令狂风止息  那波浪就平静
耶和华已经为我们行了大事
祂张开双手我们就得饱足

C
我们要欢呼  述说祂的作为
我们依靠神  就能施展大能
我们要歌颂  要欢呼  述说祂的作为
我们依靠神  就能施展大能

B
祂必带领选民欢呼向前
祂将列国的地赐给我们
祂必带领选民欢呼向前
祂将列国的地赐给我们
`,
`
赐我自由

V
赐自由的灵啊  求祢来
来到我的里面  来到我的生活
赶走生活中的愁烦
驱走我心中的不安

C
祢的灵啊  在哪里
那里就有自由
世界虽有劳苦重担
求祢灵来赐我自由
`,
`
跟随你心意

V1
我放下自己  来到祢座前
圣灵降下平静我的心  在祢爱里
天父祢为我重新得生命
与自己分离与我更靠近  相遇基督里

V2
天父祢同在  使我灵安息
心思和意念都属于祢  倾听祢声音
耶稣来亲自带领我生命
每个决定每一个脚印  都在基督里

C
我把自己全人交给祢  全心交给祢
献上这心灵  诚实敬拜  在祢同在里
负担和重担都交给祢  在祢脚前哭泣
跟随祢心意  我愿意
`,
`
无价至宝

V1
我的名字  刻划在祢心中
我的脸孔  深映在祢眼中
不是因为  我势力才能
乃是因着  祢奇妙宽容恩典

V2
虽然有时  我会跌倒软弱
祢却一直  包容不放弃我
用祢慈爱  紧紧的拥抱
我赞美祢  宝贵奇妙大爱

C
唯有祢配得  所有的赞美
一切尊贵荣耀
主祢的十架  是无价至宝
祢是我尊贵的主  耶稣
`,
`
谁能使我与神的爱隔绝

V_1
哦  神伟大的爱
何其长阔高深
竟不吝惜祂独生爱子
为我们众人舍了

V_2
神称为义的人谁能控告
谁能定他们的罪
神若帮助我们  谁能敌挡我们
谁能使我与神的爱隔绝

C_1
难道是患难吗  是困苦吗
是逼迫吗  是饥饿吗
是赤身露体  危险  刀剑吗

C_2
不论是高处的  是低处的
现在的事  将来的事
都不能叫我与神的爱隔绝
`,
`
喜乐泉源

V
祢是我喜乐泉源  祢使我欢欣跳跃
祢使我自由飞翔  不再被罪恶捆绑
祢是我永生盼望  祢爱有无比力量
从今时直到永远  祢应许不会改变

Pc
祢的宝血有能力
能医治一切的伤口
祢的复活能改变
一切的咒诅成为祝福

C_1
我们要高举祢圣名
祢配得所有最大的赞美
我们要用全心和全意  来敬拜祢

C_2
我们要欢迎祢来临
愿祢来设立宝座在这里
我们要张开口  不停赞美祢
`,
`
奇异恩典

V1
奇异恩典  何等甘甜
我罪已得赦免
前我失丧  今被寻回
瞎眼今得看见

V2
如此恩典  使我敬畏
使我心得安慰
初信之时  即蒙恩惠
真是何等宝贵

V3
我主应许美好无比
盼望永不失去
有主作为盾牌福分
我心不再畏惧

V4
天地都会渐渐废去
但我主永长存
我的生命有主看顾
我永远属于祢

C
不再有捆绑  我已得释放
我救主耶稣 已付代价
丰富恩典  今充满我
永恒的爱  奇异恩典
`,
`
你的爱

V_1
祢创造宇宙万物
统管一切所有
但祢却关心我的需要
了解我的感受

V_2
祢手铺陈天上云彩
打造永恒国度
但这双手却甘心为我
忍受彻骨钉伤苦痛

Pc
祢公义审判万民
圣洁光照全地
但祢却一再赐恩典 一再施怜悯
给我机会回转向祢

C_1
祢的爱如此温柔
超乎我心所想
这样大有能力的主
竟捧我在手掌心上

C_2
祢的爱如此深切
我知我无以报答
但愿倒空我的生命
学习祢谦卑的样式
背起我自己的十字架
`,
`
荣耀的呼召

V
将自己献上当作活祭
作主圣洁贵重的器皿
祢丰富恩惠必充足浇灌我
使我瓦器里充满莫大能力

C
高举双手赞美祢  我主
全心全人都给祢  耶稣
一生意义  活出荣耀的呼召
勇敢地向着标竿直跑

B
跟随耶稣  爱我的主
我爱祢  耶稣
跟随耶稣  爱我的主
我爱祢  耶稣
`,
`
花

V1
生命泉  涌流不停歇
泪水浸湿这一路艰险
到那日  硕果结满园
我们一同欢欣笑开颜

V2
抬头望  天堂门打开
我们将亲眼看见祢面
百花开  芬芳遍满地
荣耀主耶稣基督再来

C
花清香  云徜徉  微风拂过浪花欢唱
为祢歌唱  为祢歌唱  耶稣喔
声响彻  心翱翔  我的灵全然高唱
因祢恩典  丰富恩典  奇妙恩典
`,
`
向主欢呼

V1
主耶稣我救主
无一人能像祢
我愿一生全心赞美
祢奇妙全能的大爱

V2
祢是我安慰师
我避难所和力量
我的一切  每个气息
永远不住敬拜祢

C_1
向主欢呼  愿全地扬声唱
颂赞荣耀能力归于君王
众山跪拜  众海洋欢呼
歌颂主的圣名

C_2
我要歌唱祢大能的作为
我要永远爱祢  永远要坚定
无一事物能与祢的应许相比
`,
`
你的恩典

V
祢的慈爱  保守我心
祢的荣美  照耀我灵
祢的信实  坚顾我的生命
每当我仰望祢  天父  我感谢祢

Pc
世上的事  凡事都是虚空
徒然劳碌  转眼归于尘土
祢的国度  胜过世上所有盼望
祢的荣耀是指引我的光

C
祢的恩典够我用  超乎我所想所求
祢丰富我的道路  我的脚步  祢全都看顾
祢的恩典够我用  超乎我所想所求
因祢是唯一全能的救主
`,
`
神的良善

V1
我深爱祢  祢的怜悯永不改变
每一天祢的恩手扶持我
清晨当我睁开双眼  直到我躺卧
我要歌唱  神的良善荣美

V2
祢的声音  领我经过水火试炼
黑暗中如此亲近我的灵
祢是我的天父  祢是我良友
一生活在祢的良善荣美

C
一生信实对我顾念
一生美好待我到永远
一切所有生命气息
我要歌唱神的良善荣美

B
祢良善永看顾我  永伴随我生命
祢良善永看顾我  永伴随我生命
当我降服祢  我献上生命  所有全属于祢
祢良善永看顾我  永伴随我生命
`,
`
立定心志

V
不要让世界夺去我的心
不要让环境蒙蔽我的眼
不要让谎言使我耳发沉
不要让困难拦阻我前行

Pc
我要选择主的道路
放下为自己忧伤的权利
我要宣告主的大能
来呼喊哈利路亚

C
我立定心志  一生赞美祢
我立定心志  单单敬拜祢
愿圣灵江河涌流在我心
我立定心志  走在主圣洁光中
`,
`
信靠耶穌真是甜美

V1
信靠耶稣真是甜美
只要信靠主恩言
只要站在主应许上
信靠主蒙福无边

V2
信靠耶稣何等甜美
只要信靠主宝血
只要凭着纯一信心
能洗罪污白如雪

V3
信靠耶稣确实甜美
污秽本性即停止
得着耶稣得着一切
生命喜乐和安息

V4
我真快乐  我信靠祢
祢是我救主良友
我深信祢与我同在
从今时直到永久

C
耶稣 耶稣  何等可靠
多少事上已证明
耶稣 耶稣  宝贵耶稣
愿我信心更坚定
`,
`
每一天我需要你

V
让我坦然无惧来到施恩座前
用心灵诚实寻求祢
亲爱的天父我何等地需要祢
需要更多祢的同在  在我生命

Pc
每一天  我需要祢
祢话语如甘霖
每时刻  我需要祢
圣灵如雨降临

C
这是我的祷告
愿我生命单单归荣耀给祢  耶稣
这是我的呼求
每天都更爱祢  永不失去起初爱祢的心
`,
`
求充满这地

V1
喔主  感谢祢创造这土地
以永恒话语  赐下无限生命
用恩典的馨香气息  祝福这地
让我们全心跟随祢带领

V2
喔主  感谢祢创造这土地
以慈爱浇灌  以喜乐耕耘
用无数的白昼黑夜  孕育这地
顺服的人情  感恩的心情
现在都只愿  以基督的心为心

C1
主求祢充满我们  来医治这地
痛苦疾病要过去  神迹在运行
主求祢充满我们  来转化这地
黑暗权势要离去

C2
主求祢充满我们  来医治这地
全地看见祢荣耀  祢复兴降临
主求祢充满我们  来转化这地
全地尊荣祢圣名  为祢而站立

B
一生祝福  永不停息
世代因祢爱延续  呼求祢
`,
`
行神迹的神

V1
祢是行神迹的神
绝望中赐下盼望
瞎眼看见疾病都医治
在祢没有不可能的事

V2
祢是行神迹的神
绝望中赐下盼望
在祢没有转动的影儿
每个应许都实在阿们

C1
所以我要  要欢呼
一遍一遍不停来欢呼
直到耶利哥的城墙
一片片倒塌

C2
所以我要  要相信
一遍一遍不停来宣告
直到每个大能应许
都完全成就  成就
`,
`
这是耶和华所定的日子

V
这是耶和华所定日子
神的儿女当欢呼喜乐
耶和华已战胜仇敌  战胜仇敌
全地大声欢呼

C
耶和华是我力量  我心中一切的盼望
耶和华是我的诗歌  又是我的拯救
神子民行走全地  报好消息宣告祢的名
高举得胜的旌旗  我们称谢祢  祢是我神
`,
`
一生敬拜你

V
亲爱耶稣  祢真爱我
毫无保留  我敬拜祢
因祢舍命  我回到父神面前
在恩典和应许中敬拜

Pc
喔耶稣  喔耶稣
祢喜悦我向祢歌颂
喔耶稣  喔耶稣
高举双手  全心敬拜祢

C
我要一生  一生敬拜祢
在祢殿中瞻仰祢荣美
在祢丰盛恩典中我欢欣歌颂
在祢救恩盼望中  我灵不住快乐
`,
`
我心属于你

V
我来到祢面前
全心向祢称谢  耶稣
祢是如此爱我
我单单属于祢

C1
主我在这里  献上我的心
生命的一切  完全献给祢
因为我并没有  财宝和金银
能够献给祢  唯有我的心

C2
我唯一祷告  唯一的呼求
是祢能悦纳我  献上的全所有
愿我这一生  成为祢器皿
能完成祢旨意
`,
`
唯有主耶稣的宝血

V1
何能使我脱罪担  唯有主耶稣的宝血
何能使我得平安  唯有主耶稣的宝血

V2
何能救赎我罪人  唯有主耶稣的宝血
何能使我近真神  唯有主耶稣的宝血

V3
何能使我出黑暗  唯有主耶稣的宝血
何能使我入光明  唯有主耶稣的宝血

V4
何能救我免地狱  唯有主耶稣的宝血
何能引我上天堂  唯有主耶稣的宝血

C
主在十架流血  洗我罪恶清洁
使我洁白如雪  唯有主耶稣的宝血
`,
`
十架上的爱

V1
我总是不能明白
祢为何不会松开手
总在我无助的时候
对我说祢还爱我

V2
我总是无法想像
耶稣为我死在十架
我的罪如此的深
但祢的慈爱显得完全

C1
不会忘记认识祢的那天
祢拯救我脱离的一切
我是如此不配  祢爱何等甘甜
没有祢  我生命不可能完全

C2
主我爱祢生命献上给祢
为祢而活生命才有意义
主祢为我而死  我只愿为祢活
不会放弃  永远不分离

B
东离西有多远
我的罪全赦免
天离地有多高
祢的爱也多大
`,
`
直到永远

V1
月亮星宿哭泣  黑暗吞噬晨曦
这世界的救主已逝去
祂被钉十架上  宝血为我流下
你我咒诅都在祂肩上

V2
吐出最后气息  天堂将祂撇弃
神爱子被丢在黑暗里
就在坟墓里面  与死亡的对决
地狱的力量已被击溃

Pc
大地开始震动  石头已被挪走
祂完全的爱战胜了一切
死亡毒钩何在  我复活的君王
已将你完全打败

C
祂被尊崇直到永远
祂被高举直到永远
祂已复活到永远
我主活着永远活着

B
我们唱哈雷路亚
我们唱哈雷路亚
我们唱哈雷路亚
羔羊已经得胜
`,
`
基督是我满足

V1
祢是我奖赏  是我唯一所爱慕
这世上没有事物  能够带给我满足
在试炼中  我灵歌唱
永不回头  我得自由

C
基督 是我满足
基督 祢是我心满足
我一切所需在于祢
一切在于祢

V2
基督我全所有  救恩喜乐在于祢
这盼望永不止息  天堂是我家
暴风雨中  我灵歌唱
与祢同行  荣耀归给上帝

B1
我已经决定  要跟随耶稣
永不回头  永不回头

B2
十架在前面  世界在背后
永不回头  永不回头
`,
`
宝座

V1
天上有个荣耀的宝座
其上坐着亘古常在者
威严尊贵  公义慈爱

V2
天使天军侍立宝座前
听祂命令遵行祂旨意
俯伏敬拜  昼夜不停

B
圣哉  圣哉
圣哉  圣哉

V3
圣所的幔子已经裂开
带着羔羊宝血近前来
称谢赞美  直到永远

V4
与基督藏在神的里面
坐在高天瞻仰祂容颜
聆听主心  传祂旨意

C
兴起啊  君尊的祭司
兴起啊  圣洁的国度
在万邦宣扬祂的荣美
向万代传扬祂的作为
`,
`
全然向你

V1
当赞美的旋律响起
我的心全然向祢
当圣灵的恩膏满溢
我的灵不再封闭

V2
赞美的清泉如春雨沐浴
我心中的喜乐川流不息
赞美的音符如雪花飘逸
心中的暖流  冉冉升起

C1
我要开口向祢赞美称谢
永永远远赞美不停
永永远远称谢不已

C2
我要欣然向祢献上自己
一生一世献上自己
一生一世脚步不离
`,
`
人生二路

V1
一路邻溪  水极清冽
从中取水的必得喜悦
同源头为伴  与主手相牵
嘉实累累叶不枯干

V2
一路风啸  声灌人脑
走在其上的徒有其表
陷入罪之沼  从头直到脚
被废弃在风中飘摇

V3
向着前方  寻找希望
两条路出现如常
一条有生命  一条向死亡
不要再犹豫再彷徨

V4
我们的路  父早知道
有祂坚立使心不动摇
基督钉十架  罪污被洗净
圣灵净风苏醒心灵
`,
`
让他的喜乐充满你

V1
让祂的喜乐充满你
渗透每一个呼吸
让耶稣的爱围绕你
让祂贴近你的心

V2
让我的心单纯像祢
此刻我只属于祢
主我的心不再怀疑
我知道祢在这里

C
我只要祢  荣耀充满全地
好叫世人看见祢
主我愿意  成为祢的器皿
让赞美永不止息
`,
`
亲爱圣灵

V1
再没有事物  能与祢相比
活泼的盼望  超越全世界
祢同在里

V2
我尝到世上  最甜美的爱
当我心得释放  我羞愧都松开
祢同在里

C
亲爱圣灵  我们欢迎祢
充满这氛围  浇灌在这地
我全心渴慕祢荣耀降临
完全降服于  祢的同在里
祢同在里

B
让我更多  来感受  祢的同在
让我更多经历  祢荣耀中的良善
`,
`
一颗谦卑的心

V
求祢给我一颗谦卑的心
给我一个受教的灵
好让我能走在祢的旨意里
如同耶稣的生命

C
帮助我更多的祷告
帮助我更深的倚靠
单单相信祢  深深敬畏祢
一生要跟随祢
`,
`
十字架上

V1
高高立起的十字架  父将我罪挂上
从此以后只需仰望  罪就得着释放
I am Clean  I am Clean

V2
祢是我灵魂的救恩  从今直到永远
拒绝恶者控告谎言  宣告我今公义
我相信  我相信  I'm Clean

C1
我不会忘  十字架上
祢永恒的爱  天天带领我
脱离羞耻与捆绑

C2
我不会忘  祢无条件的爱
使我充满盼望  怜悯降下
恩典永流在全地上

B
耶稣感谢祢  耶稣感谢祢
耶稣感谢祢  赐我新的生命
`,
`
真实的敬拜者

V1
为主来到这地方
人们献上敬拜赞美
主却找不到一个
真实的敬拜者而悲伤

V2
因主所寻找的人
是一个真实敬拜者
我愿成为那一个
以心灵诚实敬拜的人

C
因主恩典  我站在这地方
因主同在  向祂俯伏敬拜
世上的一切都不能满足
惟有敬拜我的主
`,
`
圣灵的江河

V
在祢宝座前  有一道生命水流
我们进前来  谦卑等候领受
在祢同在中  有满足的喜乐
圣灵请祢来  自由运行这地

C
圣灵的江河流啊流  自由涌流在这地
在我的里面  生命活水不停息
圣灵的江河  自由涌流到无尽
我们欢迎祢  圣灵我们爱祢
`,
`
渴慕耶和华的院宇

V
万军之耶和华  祢居所何等可爱
我羡慕渴想祢的院宇
我的心肠我的肉体  向永生神呼吁
万军之耶和华

C
我的王  我的神啊
在祢祭坛那里  才能找到安息之所
如此住在祢殿中是有福的
哈利路亚  哈利路亚  哈利路亚
`,
`
能不能

V
我属于祢  祢是我永远的福分
只想日夜在祢殿中献上敬拜
定睛在祢的荣美  世上一切变暗淡
除祢以外  我还能有谁

C
能不能  就让我留在祢的同在里
能不能  赐我力量让我更多爱祢
我哪都不想去  只想日夜在祢殿中
献上敬拜  全心全意来爱祢
`,
`
我要看见

V
求祢降下同在
在祢子民的敬拜中
求祢显出荣耀
在祢子民的赞美中

C
我要看见  我要看见
如同摩西看见祢的荣耀
我要看见  我要看见
这世代要看见祢荣耀

B
我们呼求祢的名  求祢恩待我们
我们宣告祢的名  求祢怜悯我们
求祢与我们同行  使我们得安息
在祢眼前蒙恩
`,
`
恢复敬拜

V
我们的心渴望被祢充满
干涸之地期盼被祢浇灌
从荒芜到应许中的丰富
期盼春雨降临

C
降下祢的荣耀
洁净医治这地
恢复倒塌荣耀祭坛
恢复我们的敬拜

B
我们谦卑  我们回转
站在破口中祷告呼求
献上生命  领受呼召
重建祭坛  恢复敬拜
`,
`
和散那

V1
我看见荣耀君王  驾着云彩而降临
全地震动  全地震动
主祢用慈爱怜悯  将我罪完全洗净
万民歌唱  万民歌唱

C
和散那  和散那
和散那归至高神
和散那  和散那
和散那归至高神

V2
我看见全新世代  兴起要得着这地
放下自己  放下自己
我看见复兴来临  全因祷告寻求祢
我们屈膝  我们屈膝

B1
求医治洗净我心
开启我双眼看见祢心意
教我如何能爱祢的百姓

B2
我要能触摸祢心
我所做一切全为祢旨意
一生追求祢直到天地废去
`,
`
更深之处

V
高举我的双手  圣灵来充满我
更深地渴求主  认识祢更多
进入水深之处  我心炙热燃烧
只为爱祢  倾倒一切敬拜祢

C
带我进入  更深之处
带我进入  祢心意深处
带我走向  更高之处
完全献上  聆听祢声音
来爱祢

B
从前耳闻有祢  现在亲眼见祢
渴望在祢同在里  更多亲近
从前耳闻有祢  现在亲眼见祢
渴望在祢同在里  更多与祢亲近
`,
`
你爱的大能

V1
主 我亲近祢  使我心变化更新
我知在主里  祢恩典涌流
在祢慈爱里  我心中一切软弱
都将被挪去  因祢爱的大能

V2
主 开启我眼  使我与祢面对面
明白祢的爱  祢在我里面
更新我心意  向我显明祢旨意
在每日生命中  因祢爱的大能

C
拥抱我  让祢爱围绕我
吸引我  靠近祢身旁
我等候  将如鹰展翅上腾
我要与祢飞翔  祢圣灵引领我
在祢大能爱中
`,
`
如你

V1
站立在祢座前
站立在祢信实面前
祢双手领我  走出旷野
看见祢为我所预备

V2
光照在黑暗里
使脸上帕子都挪去
祢话语如镜  炼净我心
荣上加荣因祢圣灵

C1
我要贴近  贴近祢心跳的声音
思绪如祢 步伐如祢 更靠近祢
活出 像祢 丰盛的生命

C2
我要领受  祢起初对我的心意
我心渴望 荣耀如祢 圣洁如祢
基督 耶稣 我全属于祢

B
我心  坦然无惧
敬拜祢  跟随祢
永恒  在祢手里
我放下  自己
`,
`
尽情的敬拜

V1
耶稣  圣洁公义救主
彰显神的智慧能力
祢的爱是何等长阔高深
满有丰富无穷的恩典

V2
耶稣  权柄统管万有
配得荣耀尊贵颂赞
我以心灵诚实尽情敬拜
坐在宝座上深爱我的主

C
举起我的心来敬拜祢
用生命来回应祢的爱
哦 我的主  让我单单在乎祢
尽情地敬拜祢
`,
`
从心合一

V
当我们合一敬拜和祷告
神就开始动工在我们当中
神的意念高过我们的意念
祂的道路远超过我们的

C_1
从心合一  同心合意
当我们放下自己心意
为大使命献上自己

C_2
从心合一  同心合意
让我们先求神国和义
不分彼此同心向前行

B
向这世界为主发光
合一寻求神国度蓝图
不在乎自己  体贴神心意
使用我们走遍世界各地
`,
`
有一位神

V1
有一位神  有权能创造宇宙万物
也有温柔双手安慰受伤灵魂
有一位神  有权柄审判一切罪恶
也有慈悲体贴人的软弱

V2
有一位神  有权能创造宇宙万物
也有温柔双手安慰受伤灵魂
有一位神  高坐在荣耀的宝座
却死在十架挽救人堕落

C
有一位神  我们的神
唯一的神  名叫耶和华
有权威荣光  有恩典慈爱
是昔在今在永在的神
`,
`
新的事将要成就

C1
新的事新的事将要成就
新的恩膏  新的恩宠
我们要我们要唱新歌
称赞我们神为高

C2
新的事新的事将要成就
新的恩典  新的盼望
我们要我们要唱新歌
充满神的荣耀

V
祢是做新事的神
我要向祢唱新歌
恩典怜悯每天都是新的
新酒新皮袋每天要赐下
`,
`
所以我不问为什么

V1
我认识的祢是无穷尽的慈爱
我认识的祢是良善
我认识的祢是永远不会失败
我认识的祢是万物的主宰

C1_1
所以我不问为什么
就算洪水  把我的视线淹没
所以我不问为什么
因祢坐在宝座

C1_2
所以我不问为什么
祢的公义和信实从不落空
所以我不问为什么
我凭信心而活

V2
我认识的祢是温柔的阿爸父
我认识的祢是丰富
我认识的祢是恩典难以细数
我认识的祢是随时的帮助

C2_1
所以我不问为什么
还是会难过  还有忧伤的时候
所以我不问为什么
日子不总是好过

C2_2
所以我不问为什么
生命的重  有时会那么难承受
所以我不问为什么
一切在祂手中

B
有时候总有时候  祢的时候我等候
牵引我每个脚踪  如明光直到午后
苦与痛又算什么  祢冠冕为我存留
要成就极重极深  永恒的荣耀

Coda
所以我不问
不管怎么  我为祢活
`,
`
我要全心赞美

V1
全心感谢  全心赞美
进入祢的院
全心颂赞  献上为祭
是嘴唇的果子

V2
在祢里面  一无挂虑
喜乐满溢
常常感谢  不住祷告
盼望在于祢

C1
我要全心赞美
跳舞颂扬祢名
在祢殿中  一日胜过在世上千日

C2
我要全心赞美
赞美还要赞美不停
义人棚里  欢呼声永不息
`,
`
我愿为你去

V1
用圣灵与火为我施洗
让我充满天上的能力
让圣火烧尽邪情和私欲
因为我愿为祢去

V2
成为我的异象  荣耀救主
让万国的荣华尽都失色
赐我勇敢的心一无畏惧
因为我愿为祢去

C
钉痕手  引我前行
我只愿  合祢心意
看万事为损失  受苦为小事
靠祢的恩典站立

B
神圣的爱  融化我
神圣的火  熬炼我
神圣的使命  占有我
神圣的灵  引领我
`,
`
无人能像你

V
无人能像祢
唯有祢能摸着我灵深处
我虽用尽一生来追求
哦主  无人能像祢

C
祢的怜悯如江河涌流
祢的手充满医治
受苦者在祢怀里得安息
无人能像祢  无人能像祢
`,
`
永远称颂你

V
我的神  我的王
我要尊崇祢的名
我要永永远远称颂祢
我要天天歌颂  我要永远赞美
祢本为大  当受大赞美

C
世世代代都要称颂祢
要传扬祢大能作为
述说祢威严和尊贵
要永远称颂祢名
`,
`
永远尊贵

V
耶稣  真神羔羊
配得所有敬拜赞美
天上地下  万口宣扬
祢是弥赛亚

C1
我尊崇祢  我尊崇祢
尊崇祢名超乎万名
祢的国度在全地之上
何等圣洁  永远掌权

C2
我尊崇祢  我尊崇祢
尊崇祢名超乎万名
祢的荣耀充满全地
何等荣美  永远尊贵
`,
`
勇敢走出去

V
我并不完美  也并不特别
而祢却是为我舍弃生命的主
我时常软弱  有时会迷惑
但祢是道路真理和生命

C1
主祢要往哪里走
我就跟祢走
领我走到世界尽头
一生不再回头

C2
让世界听到我们敬拜
我们的祷告
让复兴从我们开始
将主爱带到人群中

Coda
纵然有许多的问题
我也不放弃
祢大能赐给我勇气
我会勇敢走出去
`,
`
天堂门敞开

V
我灵静候在这个地方
我心紧抓住祢赐下的应许
我灵渴望有祢的同在
我心渴慕着看见祢国度降临

Pc1
唯有祢能改变这地
让破碎的站起歌唱

Pc2_1
唯有祢能改变这地
让破碎的站起歌唱
枯干之地能见百花盛开

Pc2_2
唯有祢能复兴这地
让黑暗之地见真光
为祢荣耀  求祢来充满我

C1
天堂门敞开  祢圣灵降下来
像那风一样  触摸这个地方
天堂门敞开  祢圣灵降下来
像雨露一般  浇灌这片大地

C2
天堂门敞开  祢圣灵降下来
让锁链断开  受困奴役得自由
天堂门敞开  祢圣灵降下来
像火焰一般  点燃我心中的火
`,
`
唯有我主

V1
谁能融化铁石心
让我的灵魂苏醒
谁能让世界转动
仍紧紧拥抱我

V2
谁能看透我内心
仍深深爱着我
谁在我生命掌权
又一路牵我走

V3
谁让公义人光洁
谁用恩典开道路
在我最黑暗时刻
祢爱不离不弃

Pc
我愿以一生  来颂扬祢爱
只需要祢
我灵魂的主  我心的君王
是主耶稣

C
唯有我主
唯有我主

B
听大海咆哮  看天空变亮
让万众来  向主歌唱
听石头呼喊  看群山屈膝
让万众来  向主敬拜
`,
`
一粒麦子

V1
一粒麦子
它若不落在地里死了
不论过了多少时候
它仍旧是它自己

V2
它若愿意
让自己被掩埋被用尽
就必结出许多子粒
经历生命的奇迹

C1
主 我愿意  主 我愿意
让自己像种子落在地里
失丧生命必反得生命

C2
主 我愿意  主 我愿意
放下自以为应得的权利
在我身上成就祢旨意

B
呼召如此崇高  种子何等渺小
定睛标竿直跑  必见神的荣耀
`,
`
在你荣耀中

V_1
无论我往哪里去
求祢与我同行
因祢的同在
是我蒙爱的确据

V_2
即使我身在旷野
只要得见祢面
有祢的同在
在黑暗中我得见光

C
在祢荣耀中  在祢荣耀中
所有的一切不再重要  转眼已成空
我别无所求  我别无所求
只愿祢同在永远停留
`,
`
耶稣万国的盼望

V1
耶稣  万国的盼望
耶稣  忧伤者的安慰
祢是这世界唯一的盼望

V2
耶稣  黑暗中的光
耶稣  现实中的真理
祢是这世界唯一的盼望

Pc
因祢为我道成肉身
断开黑暗  复活得胜

C1
祢是我神  永住我心
祢是磐石  我所倚靠
祢是真光  照亮在全世界之上

C2
祢已经复活  战胜惧怕
和平君王  领我亲近
耶稣我主  祢是我永活的盼望
我信靠祢
`,
`
医治的爱

V
在泥泞深谷中  祢领我走出来
我跌跌又撞撞  是祢扶我站起来
我满身是伤痕  祢将我抱起来
我在祢的怀中  苏醒过来

C1
耶稣的爱  医治了我的心
破碎的生命  完整起来
心中又燃起  光明的期待
再一次  勇敢将自己敞开

C2
耶稣的爱  刚强了我的心
信心的翅膀  再飞起来
飞越每一个  高山和低谷
感谢耶稣  医治的爱
`,
`
不再被奴役

V1
祢爱的旋律  释放我生命
祢爱四面环绕我
从敌人手中  祢拯救了我
惧怕中得自由

V2
从我母腹中  祢拣选了我
祢爱呼唤我名
我重生得救  进入祢家中
宝血流入我生命

C
我不再被恐惧奴役
因祢是我天父

i
哦哦哦 哦哦哦

B
祢将大海分开让我能穿越
完美的爱淹没恐惧
祢拯救我让我能兴起歌唱
因祢是我天父
`,
`
爱我的天父

V1
有位爱我的天父
祂永远不放弃我
祂爱的同在使我完全
我深知祂顾念着我
我知祂顾念着我

V2
在许多危难时刻
在流泪的过程
祢永不离开或丢弃我
我深知祢顾念着我
我知祢顾念着我

C
吸引我  贴近祢心
拥抱在祢怀里
我爱祢  我的天父
祢是我的一切
`,
`
你是我藏身处

V
祢是我藏身处
祢必以得救的乐歌四面环绕我
每当我心惧怕时
我要倚靠祢

C
我要倚靠祢
让软弱的人
说我在主里已刚强
`,
`
宁静谷

V1
在我心灵深处  有一座宁静谷
我和我亲爱的主  在其中安然漫步

V2
生活中的仓促  生命里的难处
只愿向祂来倾诉  平安祝福在这谷

C
我与我主  相约之处
倘佯这份宁静安详  就像是在天堂
我与我主  相约之处
主领我过死荫幽谷  使我喜乐走人生路
`,
`
不动摇的信心

V
主 赐给我  不动摇的信心
海浪之中  祢伸出大手拉住我
求除去我  心中所有的怀疑
旷野之中  紧紧跟随  云柱火柱

C1
海浪之中  我必不沉落
旷野之中  我必不迷路
不退缩也不害怕  不动摇也不放弃
因我深信祢应许不改变

C2
困难之中  我仍然赞美
疑惑之中  我仍然祷告
行在水面的信心  刚强壮胆地前进
我的神必在前面为我争战

B
我的祷告  无论求什么
只要相信  就必得着
我的祷告  无论求什么
只要相信  只要相信
只要相信  就必得着
`,
`
父的筵席

V1
我们是神的儿女
不活在恐惧里
我们不孤单
因为有祢在这里

V2
真理已战胜谎言
我们已得着自由
因着信而称义
靠耶稣得生命

C
父已预备筵席
等着祂儿女
父为我们预备筵席
等着祂儿女回到怀里

B1
我的被造有祢的心意
祢对我的爱永无止尽

B2
我的被造有祢的心意
祢的爱无止尽
`,
`
你是我气息

V1
这是我心所求
这是我心所求
祢圣洁同在  进入我心

V2
这是我心渴慕
这是我心渴慕
祢至圣话语  向我诉说

C
而我  多么需要祢
而我  不能失去祢
不能失去祢
`,
`
不能隔绝的爱

V1
山不能 海不能  不能隔绝神的爱
风不能 雨不能  不能隔绝神的爱
都不能

V2
困难不能 疾病不能  不能隔绝神的爱
危险不能 逼迫不能  不能隔绝神的爱
都不能

V3
都不能 都不能 不能隔绝神的爱
都不能 什么都不能 不能隔绝神的爱
什么都不能

C
都不能隔绝  都不能隔绝
都不能隔绝神的爱
`,
`
从早晨到夜晚

V1
早晨我睁开眼睛
渴望聆听祢声音
心中思想祢的好
更多与祢来亲近

V2
夜晚我仍要歌唱
向祢阐明我心意
敬拜化成一首歌
单单要唱给祢听

C
从早晨到夜晚  从旷野到高山
亲爱主  我要称颂祢美名
从早晨到夜晚  祢爱永不止息
亲爱主  一生紧紧跟随祢

B
我的主  我爱祢
我要夸祢的爱无止尽
我的主  我爱祢
我要夸祢的爱无止尽
`,
`
永远圣洁

V1
世世代代俯伏  全心全意敬拜
齐声宣扬称颂  神羔羊
众圣徒众儿女  万族万民万邦
齐声宣扬称颂  神羔羊

V2
我已被祢赦免  我已被祢赎回
永远宣扬称颂  神羔羊
我已得着自己  奉靠耶稣之名
永远宣扬称颂  神羔羊
永远宣扬称颂  敬拜祢  阿们

Pc1
祢名  高过穹苍
祢名  何等伟大
祢名  超乎万名之上

Pc2
所有宝座冠冕
所有能力权柄
祢名  超乎万名之上

C1
众天使呼喊  圣洁
万口要敬拜  圣洁
我们高举祢  圣洁
圣洁到永远

C2
神儿女歌唱  圣洁
全地的君王  圣洁
祢永不改变  圣洁
圣洁到永远
`,
`
我们爱（让世界不一样）

V
你和我是天父爱的创造
每个人有最美的梦想
一路上彼此照亮  扶持拥抱
我们的爱让世界不一样

C1
我们爱  因神先爱我们
虽你我不一样  我们一路唱
走往祝福的方向

C2
我们爱  因神先爱我们
心再坚强也不要独自飞翔
只要微笑  只要原谅
有你爱的地方  就是天堂
`,
`
在这里

V
神的子民合一聚集
热切期盼遇见祢
天要敞开  神的道传遍
因为我们渴慕寻求祢

C
在这里  在这里  耶稣祢现在在这里
我相信  我相信  喜乐的江河在这里
荣耀彰显  奇妙神迹将显明
天上国度降临在这里

B
祢的灵在这里  这里就有自由
圣灵自由运行无止尽
移山倒海信心  坚定不断升起
期待伟大神做奇妙事
`,
`
敬畏的心

V1
祢的圣洁永不改变
此刻我来见祢荣面
承认祢是我所有一切
屈膝谦卑

V2
此刻列国都要看见
世界因祢爱被挽回
在恩典之下  我仍敬畏
何等伟大配得赞美

C1
Holy  Holy
何等的圣洁  主我要敬畏
祢的一切充满我心
祢就是我唯一的真理

C2
Holy  Holy
何等的荣美  如此的尊贵
当我敬畏  就得着智慧
这一刻我只想专心跟随

B
哈利路亚  Oh  哈利路亚
祢是万主之主  万王之王
坐在宝座上  复活的君王
我降服在祢爱之下
`,
`
你的恩典够我用

V1
祢的恩典够我用
在我软弱困苦中
每个脚步祢立定
每天需要祢供应

V2
祢的恩典够我用
当四围波涛汹涌
无论前途将如何
祢是我生命舵手

C1
再次信靠祢  生命交给祢
我慈爱的父亲
炼净我的心  使我能像祢
辉映祢荣形

C2
再次信靠祢  生命交给祢
我慈爱的父亲
开我的眼睛  使我得见祢
明白祢心意

C3
再次信靠祢  生命交给祢
我慈爱的父亲
开我的眼睛  使我得见祢
明白祢心意

C4
再次信靠祢  生命交给祢
我慈爱的父亲
展开我双臂  欣然奔向祢
安稳祢怀里
祢的恩典够我用
`,
`
圣哉全能主

V
圣哉 圣哉 圣哉  万军之耶和华
昔在 今在 以后永在
圣哉 圣哉 圣哉  万军之耶和华
昔在 今在 以后永在

C
全地充满了祂的荣耀
全地充满了祂的荣耀
全地充满了祂的荣耀
圣哉全能主

B1
我见亘古常在者
坐在高高的宝座
从祂面前有火像河发出
事奉祂的有千千  侍立在祂面前有万万
案卷已展开  祂要施行审判

B2
神 我得罪了祢
无知不认识祢
唯靠羔羊的血将罪债还清
求祢施恩怜悯  降下灵火洁净
医治这破碎  痛悔的心
`,
`
充满在这里

V1
神的国度从天降下来
神的光辉照亮在这里
荣耀尊贵围绕在宝座前
圣洁荣光遍满在全地

V2
神的能力从天降下来
神的荣美彰显在这里
天使天军俯伏在祢面前
大能同在充满祢殿宇

C
在这里  在这里
荣耀同在充满在这里
让我们谦卑寻求祢
在祢殿中与祢相遇
在这里  在这里
恩典能力充满在这里
让我们的敬拜不停息
将当得的荣耀全都归于祢

B
荣耀国度充满在这里
大能同在充满在这里
尊贵荣耀充满在这里
圣洁荣光充满在这里
`,
`
靠着耶稣得胜

V
在祢爱里我要宣告  我软弱得改变
在祢爱里我要宣告祢是王
在祢爱里我要宣告  我不在罪中打转
是祢带领着我得胜

C
靠着耶稣得胜  靠着耶稣得胜
终此生要靠着主爱去得胜
靠着耶稣得胜  靠着耶稣得胜
不必惧怕挫败  深知主恩更广阔
是祢带领着我得胜
`,
`
安静

V
安静  让平安入我心
深深知道祢是我的神
风浪  让我灵更坚定
在我身旁祢使风浪平息

C
我不害怕  我仍然要敬拜
祢陪我走向应许之处
充满盼望  我一生要敬拜
生命满有祢的印记
`,
`
与你更靠近

V
主祢是我的避难所
祢爱将我紧紧的拥抱
使我苏醒祢爱里
我愿成为祢的居所
我要爱祢要永远坚定的爱祢
(亲近祢)

C
主我愿让祢来拥有我的心
不再用力坚持倚靠我自己
愿祢每句话语  都成为我命定
改变我生命一步一步与祢更靠近
(走进祢心意)

B
没有人能像祢
用爱满足我心
祢是我的唯一
`,
`
你们要赞美耶和华

V1
你们要赞美耶和华
在祂的圣所赞美祂
你们要赞美耶和华
在祂的穹苍赞美祂

C1
要因着祂的大能赞美祂
要因着祂的荣耀赞美祂
要因着祂的慈爱赞美祂
凡有气息都要来赞美祂

V2
我们要赞美耶和华
来敞开胸怀赞美祂
我们要赞美耶和华
来高声欢呼赞美祂

C2
我们要鼓瑟弹琴赞美祂
我们来击鼓跳舞赞美祂
我们用丝弦乐器赞美祂
凡有气息都要来赞美祂
`,
`
圣灵的火

V1
耶稣  亲爱的耶稣
欢迎祢来  全心欢迎祢来
用圣灵与火来为我施洗
因祢是我的智慧  我的公义

V2
耶稣  亲爱的耶稣
欢迎祢来  全心欢迎祢来
洗净我的污秽和一切罪恶
因祢是我的圣洁  我的救赎

C1
喔 圣灵的火  喔  圣洁的火
来炼净我  来复兴我
燃烧我对耶稣的热情

C2
喔 圣灵的火  喔 圣洁的火
赐下能力
让我活出主耶稣的生命
影响这世代
`,
`
真实的悔改

V
主祢已救赎我们  招聚我们
为祢争战
主我们同心寻求
祢的国度 祢的公义
求祢赦免  我们得罪了祢
从今天起  我们要顺服祢旨意

C1
主我们真实的悔改
回转到祢面前
求祢赦免我们的罪
洁净我们的心

C2
主再次赐下祢恩典
再次赐下怜悯
求祢塑造我们生命
为祢而活
一生讨祢喜悦
`,
`
当我抬头仰望

V1
人算什么  祢竟顾念他
世人算什么  祢竟眷顾他
祢赐下荣耀尊贵  作为他冠冕
使地上万物都俯伏在他面前

V2
我算什么  祢竟顾念我
我没做什么  祢却垂怜我
当我未出生以前  祢已先爱我
为了我打造专属的人生路

C1
当我抬头仰望祢手造的天
深知祢多么爱我远超过一切
患难困苦  死荫幽谷
也无法将我与祢的爱隔绝

C2
当我放下自己垂靠祢怀里
我的灵雀跃欢欣不停赞美祢
耶稣基督  我的救主
祢的宝血赎回了我的生命  耶稣

B
不再悲伤  不再彷徨
祢的爱拥抱我遮盖了一切
我深知道  世上所有
都无法将我与祢的爱隔绝
`,
`
我宁愿有耶稣

V1
我宁愿有耶稣  胜于金银
我宁属耶稣  胜过财富无边
我宁愿有耶稣  胜于地土
愿主钉痕手  引导我前途

V2
我宁愿有耶稣 胜于称扬
我宁忠于主  满足主的心肠
我宁愿有耶稣  胜于美名
愿对主忠诚  宣扬主圣名

C
胜过做君王  虽统治万方
却仍受罪恶捆绑
我宁愿有耶稣  胜于世上
荣华  富贵  声望
`,
`
Shekinah荣耀

V
我等候祢  我等候祢
我等候祢  走进这里

Pc
在这里等候祢的同在
在这里等候祢的同在
Shekinah  荣耀降下
Shekinah  荣耀降下

C
全然释放  祢宝贵圣灵
Shekinah  降下来
Shekinah  降下来

B1
You move  我们要更多
You speak  我们要更多
You move  我们要更多
完全得着祢

B2
渴慕祢  渴慕祢  渴慕祢
渴慕祢  渴慕祢  渴慕祢
渴慕祢圣灵
`,
`
神羔羊配得

V1
感谢祢的十字架
感谢祢付上代价
担当我罪和羞愧  使我完全
赐下奇妙恩典

V2
感谢祢无比大爱
感谢祢钉痕双手
宝血洗净我污秽  使我了解
祢完全包容赦免

C
神羔羊配得  坐在宝座上
头戴着尊贵冠冕  祢作王到永远
来尊崇赞美  耶稣神儿子
从天降下被钉十架  神羔羊配得
`,
`
我神我王

V
除祢以外  天上有谁
祢是我所爱慕
虽我肉体  渐渐衰退
祢是我的力量

Pc
走过死荫幽谷  我仍要宣扬
祢与我同在  祢使软弱者得刚强

C
我神我王  我信靠祢
我的盼望  我仰望祢
祢是我心里的力量
我的福分直到永远

B
受患难  却不被压碎
心困惑  却没有绝望
受逼迫  却不被撇弃
被打倒  却没有灭亡
`,
`
叫我抬起头的神

V
耶和华是我的主  必不致动摇
有耶和华的帮助  还要惧谁呢
耶和华是我牧者  必不致缺乏
有耶和华作我旌旗  必全然得胜

C
耶和华是我四围的盾牌  是我的荣耀
又是叫我抬起头的神
一宿虽然有哭泣  早晨我们必欢呼
祢是我的磐石  我的帮助
`,
`
扬声唱哈利路亚

V1
扬声唱哈利路亚  在我的仇敌面前
扬声唱哈利路亚  胜过不信和怀疑
扬声唱哈利路亚  赞美是我的武器
扬声唱哈利路亚  天堂降临得胜利

V2
扬声唱哈利路亚  用尽我的全心全意
扬声唱哈利路亚  我看见黑暗都逃离
扬声唱哈利路亚  当我身处未知的奥秘
扬声唱哈利路亚  爱使我不再恐惧

C
我要歌唱  就算在风暴之中
我扬声赞美  呼喊直到充满全地
从灰烬之中  盼望升起
死亡已溃败  君王已复活

B1
我要扬声赞美
我要扬声赞美
我要扬声赞美
我要扬声赞美

B2
我要扬声赞美  在我的仇敌面前
我要扬声赞美  胜过不信和怀疑
我要扬声赞美  赞美是我的武器
我要扬声赞美  天堂降临得胜利
`,
`
耶稣唯有你

V1_1
谁让太阳升起
照耀这地带来全新生命
耶稣  唯有祢
谁让星空降临
看我安然进入甜美梦境
耶稣  唯有祢

V1_2
谁供应我丰富生命  谁看顾了我所需
谁会与我同行  伴我成长  渡过一切经历
耶稣  唯有祢
耶稣  唯有祢

V2_1
谁看见我伤痛
在软弱无助时扶持着我
耶稣  唯有祢
谁平静了风浪
在绝望恐惧时与我同在
耶稣  唯有祢

V2_2
谁担当了我的罪孽  谁呵护着我的心
谁将我的恐惧  所有意念钉在十字架上
耶稣  唯有祢
耶稣  唯有祢

C
我高举双手  扬声歌唱
一生年日  一生成败  一切所有
将我的生命  完全献上
唯有祢配得  耶稣  唯有祢
`,
`
苏醒

V1
黎明之际  盼望兴起
我仰望祢  宣告祢名
让我与祢  心跳合一
就在这里  与祢同行

V2
在我眼中有火  被祢点燃
不羁的爱  燃烧起来
永恒的光  街头绽放
祢突破黑夜冲出来

Pc
祢的爱一直都在
永远不会离开
为了我  而存在
要点燃这个世代

C
祢让我苏醒  让我苏醒
祢的爱充满我心

B
祢的爱  祢的爱
祢的爱  到永远（我知道）
`,
`
俯伏

V1
俯伏  在祢面前
俯伏  祢是我的主
敬拜  得见祢荣面
献上我的一切

V2
俯伏  放下主权
俯伏  倾倒我的爱
敬拜  与祢面对面
祢爱充满同在

C
我的心  专注于祢
专注于祢  我的主
我一生  单单敬拜
单单敬拜  我的主

B
赏赐在于祢  收取在于祢
我心坚定  勇敢向前行
赏赐在于祢  收取在于祢
我心坚定  勇敢向前行
`,
`
我要顺服

V
耶稣基督是至宝
是生命中的美好
十字架是我的荣耀
一生都跟随快跑

C1
我要顺服  因为我爱祢
无论何处  到哪里都忠心
世界万物  都丢弃看作粪土
为要得着耶稣基督

C2
我要顺服  因为我爱祢
无论何处  到哪里都忠心
一生活出  基督福音的托付
献给耶稣  我所有的全部
`,
`
这是奇妙恩典

V1
谁战胜黑暗  罪恶的权势
谁爱有能力  远胜过一切
荣耀的君王  万王之王耶稣

V2
谁命令雷声  震动这世界
谁令人赞叹  祂奇妙作为
荣耀的君王  万王之王耶稣

C
这是奇妙恩典  祢的爱不改变
祢竟会代替我  为我承担十架
舍下祢的生命  释放我得自由
耶稣我歌颂  祢所做的一切

V3
谁从混乱中  领我回正路
谁使这孤儿  成为神儿女
荣耀的君王  荣耀的耶稣

V4
谁统管列国  以真理公义
在祂荣耀中  闪亮如晨星
荣耀的君王  万王之王耶稣

B
尊贵的羔羊  祢配得
征服死亡的君王  祢配得
配得  配得  耶稣
`,
`
安静知道

V
安静 知道  因祢是我神
安静 安静  因祢是我的神

C
万国知道  祢至圣尊名
全地传颂  响彻雷鸣
崇山峻岭  传扬祢是神
人类无法  无法承受
祢恩典宝座而来的荣耀
所以我们在祢面前安静

B
敬畏着祢  敬畏着祢
屈膝敬拜  俯伏敬拜
万世万代  祢国度永无穷
`,
`
赞美中信心不断升起

V
我的口  要不停赞美
我的手  要不停高举
因祢应许  是我的信心
每个困难中  我经历神迹

C
赞美中  信心不断升起
泪水中  我依然高声唱
祢的信实  上达穹苍
祢的应许  从不落空
赞美中  信心不断升起
泪水中  我依然高声唱
纵然前路迷茫  我心失望
祢的话是灯  照耀前方
`,
`
我的生命献给你

V
献上生命  给最爱的耶稣
完全顺服  完全降服
因祢恩典  使我得以事奉祢
祢的选召没有怀疑

C
我的生命献给祢  背起十架跟随祢
愿祢的荣耀  彰显在我生命
我的心不要忘记  祢如何为我舍命
耶稣我爱祢  喜乐地跟随祢
`,
`
你信实何广大

V1
祢信实何广大  我神我天父
全无转动影儿  藏在祢心
祢不改变  祢慈爱永不转移
无始无终的神  施恩不尽

V2
春夏秋冬四季  有栽种收成
日月星辰时刻  循转不止
宇宙万物都为  造物主见证
述说天父莫大  信实仁慈

V3
祢赦免我罪愆  赐我永平安
祢的容光亲自  安慰引导
日日加力  更赐我光明盼望
祢所赐的恩爱  永无止尽

C
祢信实何广大  祢信实何广大
每早晨赐下新丰盛恩惠
我一切需要  祢手丰富预备
祢信实何广大  显在我身

Coda
阿们  阿们  阿们  阿们
`,
`
扬声欢呼赞美

V
扬声欢呼赞美称颂我的王
高声颂扬欢唱哈利路亚
来到主宝座前尊崇赞美祂
我们欢呼喜乐进入神的面前

C
祢是创造主  祢施行拯救
祢已救赎我  祢是主  最大的医生
祢是丰盛之主  祢是我的牧者引领我
耶稣我君王  我赞美祢
`,
`
一切歌颂赞美

V
一切歌颂赞美  都归我主我的神
祢是配得歌颂与赞美
我们高声呼喊  高举耶稣圣名
哈利路亚

C
赞美主  哈利路亚
赞美主  哈利路亚
哈利路亚
`,
`
主我仰望你

V
主我仰望祢  我全然信靠祢
赐我异象  能看见祢心意
主我仰望祢  我帮助来自祢
赐我智慧  凡事都在祢手里

C
我的力量我爱祢  我的盾牌我爱祢
哦 我的磐石我爱祢  从永远到永远
我要爱祢主
哈利路亚神掌权  哈利路亚神掌权
哦 哈利路亚神掌权  从永远到永远
哈利路亚
`,
`
我安然居住

V
我来到祢宝座  献上我的祷告
在这宁静时刻  我听见祢的声音
因为祢的爱  已经找到了我
使我配得走进祢的同在里
在这安静时刻  祢聆听我呼求
享受在祢的荣耀圣洁中

C
求祢仰起脸来光照我的心
祢使我心充满了快乐
主啊祢是我全然信靠
耶和华使我安然居住
`,
`
耶稣万国的盼望

V
耶稣  万国的盼望
耶稣  忧伤者的安慰
祢是这世界唯一的盼望
耶稣  黑暗中的光
耶稣  现实中的真理
祢是这世界唯一的盼望

Pc
因祢为我道成肉身
断开黑暗  复活得胜

C
祢是我神  永住我心
祢是磐石  我所倚靠
祢是真光  照亮在全世界之上
祢已经复活  战胜惧怕
和平君王  领我亲近
耶稣我主  祢是我永活的盼望
我信靠祢
`,
`
我渴望看见

V
我们等候主  不住寻求祢面
昼夜地祷告  为这世代呼求
侧耳来垂听  谦卑悔改声音
愿救赎和医治临到这地

C1
我渴望看见祢的荣耀彰显
像云彩围绕充满在这地
圣灵如风地吹进  每颗枯干的心灵
我们灵魂再次地苏醒

C2
我渴望看见祢的荣耀彰显
祷告的声音如水不停息
父亲回转向儿女  儿女回转向父亲
每个世代合一敬拜祢

B1
不停地叩门  不停地寻求
天上的门为我们打开
不停地祷告  不停地呼喊
呼求复兴临到这世代

B2
我们在叩门  我们在寻求
天上的门为我们打开
我们在祷告  我们在呼喊
呼求复兴临到这世代
`,
`
我们的神

V
诸天述说天父的荣耀
穹苍传扬奇妙的作为
张开双手  万物得饱足
万口承认祢是我们的神

C
我们的神  坐在宝座上
圣殿充满荣耀  万民敬拜
全能的神  我们尊崇祢
圣洁荣耀  尊贵  能力  都归于祢

1B
祢说话  命立就立
祢吹气  就得生命
万物齐唱哈利路亚
圣哉  圣哉  圣哉

C
我们的神  坐在宝座上
圣殿充满荣耀  万民敬拜
全能的神  我们尊崇祢
圣洁荣耀  尊贵  能力  都归于祢
`,
`
我们呼求

V
主 我们同心在祢面前  以祷告寻求祢面
我们转离所有的恶行  定意单单跟随祢
主我们是属祢的子民  求赐下父神的心
我们要回转向祢父神  也要看见复兴

C
我们呼求祢阿爸父  设立祢宝座在这地
祢必睁眼看侧耳垂听  奉主名的呼求
万民都要来敬拜祢  荣耀高举祢的圣名
复兴这地  全能的君王  我们欢迎祢
`,
`
我们一起祷告吧

V
我们一起祷告吧
来到主跟前屈膝敬拜
祂是怜悯的主
我们向着天举起双手

C
求祢打开天上门
将丰沛的恩雨  滋润充满整个大地
终于看到主降临
公义的雨丝  浇灌在我们的身上
`,
`
我们在天上的父

V
我们在天上的父  祢的名为圣
愿祢的国降临  愿祢旨意成全
在地上如同在天上  愿祢国降临
在地上如同在天上  愿祢国降临

Pc
愿祢国降临  愿祢国降临

C
国度属于祢  权能属于祢
荣耀属于祢  到永远  阿们
`,
`
每当我瞻仰你

V1
每当我瞻仰祢至圣荣面
每当我在爱中仰望祢
在祢荣耀光中
所有一切都失去光彩

V2
何等喜乐当我进入祢心意
我全心成为祢爱的宝座
在祢荣耀光中
所有一切都失去光彩

C
我敬拜祢  我敬拜祢
我一生活着为要敬拜祢
`,
`
我的救赎者活着

V1
我知道  我的救赎者活着
祂是永活的主
当我在深谷迷失时
祂领我走正义路

V2
我知道  我的救赎者活着
祂是永活的主
当我在旷野孤独时
祂伴我作我的灯

C1
我知道我的救赎者永远活着
我心不再忧虑
我要在每一个日夜中
领受祂的丰盛之爱

C2
我知道我的救赎者永远活着
我灵不再沉睡
当号角响起的那一天
我将见祂荣光之面
`,
`
我知谁掌管明天

V1
我不知明天的道路  每一天只为主活
我不借明天的太阳  因明天或许阴暗
我不要为将来忧虑  因我信主的应许
我今天要与主同行  因祂知前面如何

V2
每一步越走越光明  像攀登黄金阶梯
每重担越挑越轻省  每朵云披上银衣
在那里阳光常普照  在那里没有眼泪
在美丽彩虹的尽头  众山岭与天相连

V3
我不知明天的道路  或遭遇生活苦楚
但那位养活麻雀者  祂必然也看顾我
祂是我路途的良伴  或经过水火之灾
但救主必与我同在  祂宝血把我遮盖

C
有许多未来的事情
我现在不能识透
但我知谁掌管明天
我也知谁牵我手
`,
`
生命活水充满我

V
在祢宝座前
是我藏身处
祢必以得救的乐歌
四面来环绕我

Pc
主祢是生命的源头
主祢是永恒的真光
在祢圣洁的光中
我得自由必见光

C
充满我  洁净我
在祢宝座前
有生命水涌流
更新医治我
`,
`
降下你大能

V
降下祢大能  降下祢恩膏
降下祢医治在这地
降下祢大能  降下祢恩膏
降下祢医治在这地

C
降下来  降下来
降下来  在这地
降下来  降下来
降下来  在这地
`,
`
我们欢迎君王降临

V
宇宙的中心  耶稣
世界的中心  耶稣
万物都本于祢  属于祢  归于祢
祢是荣耀君王

C
我们欢迎  君王降临
渴望看见  祢的彰显
呼求祢来翻转  震动这土地
复兴我们圣洁的热情
我们欢迎  君王降临
同心高举  祢圣洁的名
呼求天窗打开  春雨不停息
我们呼喊欢迎君王降临

B
大大张口  大大充满
恩膏如雨  浇灌这地
眼未看见  耳未听见
渴慕更多  看见祢的荣面
`,
`
新耶路撒冷

V1
期待那一天
亲眼见祢面
永远不分离
在新耶路撒冷

V2
城内有一道
生命水的河
黄金的街道
有神荣耀光照

C
看哪  神的帐幕在人间
亲自与我们同在
我们作祂子民  与祂同住
看哪  神的帐幕在人间
擦去一切的眼泪
不再有伤悲  因一切都更新

B
不再有死亡  也不再有悲哀
没有哭号疼痛  以前的事都过去了
这是我渴慕  这是我等待
永永远远  与祢同作王
`,
`
配得

V1
祢背起我十架
使我因祢付的代价得自由
而如今我属祢
我要歌唱祢的良善直到永远

C
祢的名配得
耶稣
祢配得赞美
祢配得尊崇

V2
如今我不羞愧
我惊叹于祢无可否认的爱
祢恩典不止息
我要歌唱祢的良善直到永远

B
如今在诸天祢被高举
祢荣耀充满这地
祢配得所有赞美
祢超乎万名之名
`,
`
何等荣美的名

V1
祢就是太初神的道
至高主与神同在
在造物中隐藏祢荣耀
今显明在基督里

V2
为了与我们同享天堂
祢带着天国降临
我罪虽重但祢爱更深
我们永远不分离

C1
这是何等荣美的名  这是何等荣美的名
我王耶稣基督圣名
这是何等荣美的名  无一事物相比
这是何等荣美的名  耶稣的圣名

C2
这是何等奇妙的名  这是何等奇妙的名
我王耶稣基督圣名
这是何等奇妙的名  无一事物相比
这是何等奇妙的名  耶稣的圣名

C3
这是何等大能的名  这是何等大能的名
我王耶稣基督圣名
这是何等大能的名  无一事物相比
这是何等大能的名  耶稣的圣名

B1
死困不住祢  幔子已挪去
罪和阴间屈服于祢
与天堂欢庆  祢荣耀显明
死里复活祢得胜利

B2
祢无所匹敌  祢无人相比
耶稣掌权直到永远
国度属于祢  荣耀属于祢
超乎一切我主圣名
`,
`
永远掌权

V1
祢真好祢真好  无人能与祢相比
祢的爱祢的爱  完全向世人显明
祢是光祢是光  当黑暗向我靠近
祢是我的盼望  我的罪全都洗净

V2
祢是我的平安  当恐惧抓住我心
祢信实不改变  甚至当我远离祢
祢是我的喜乐  我歌唱单单为祢
祢赐给我生命  死亡失去了权柄

C
喔主  我奔向祢胸怀  我奔向祢胸怀
祢丰盛的大爱  永远与我同在
祢的拥抱  何等甘甜
世界真光  永远掌权

V3
有更多有更多  超过我所想所求
祢是主祢是主  万物都宣扬述说
祢在这祢在这  遮盖我所有软弱
祢是神祢是神  为祢放弃全所有

Coda
我灵歌唱  别无他名
耶稣  耶稣
`,
`
主我邀请你

V1
让我回到那起初的爱
让我对祢忠贞专一
为我再造一颗清洁的心
让我完全属于祢

V2
让我时常回到加略山
让我不负祢的爱情
为我再次融化冰冷的心
让我全心爱慕祢

C
主我邀请祢  恭敬地邀请祢
再登上我心的宝座
主我邀请祢  衷心地邀请祢
再登上我心的宝座
`,
`
世界之光

V
耶稣  世界的盼望
唯一的真光  照亮一切黑暗
耶稣  道路真理和生命
配得至圣尊荣  到永远

C
万国万民  齐来敬拜
在圣洁的光中  高举耶稣基督的名
天上地下  齐来敬拜
愿荣耀都归祢  愿荣耀都归祢
愿荣耀都归祢  世界之光

B
哈利路亚  哈利路亚
哈利路亚  哈利路亚
`,
`
宝贵十架

V1
主耶稣  我感谢祢
祢的身体  为我而舍
带我出黑暗  进入光明国度
使我再次能看见

V2
主耶稣  我感谢祢
祢的宝血  为我而流
宝贵十架上  医治恩典涌流
使我完全得自由

C
宝贵十架的大能赐我生命
主耶稣我俯伏敬拜祢
宝贵十架的救恩是祢所立的约
祢的爱永远不会改变
`,
`
建造我生命

V1
超越我们所能传唱的一切
超越我们献上的一切赞美
超越我们口中每一个呼吸
活着为祢

V2
耶稣圣名高过世上的一切
耶稣我们生命唯一的拯救
超越我们口中每一个呼吸
活着为祢  活着为祢

C
圣洁  无人能够像祢
谁能与祢相比  开我眼看见祢作为
显明祢自己  让我贴近祢心
引导我脚步在祢爱中前行

B
建造我生命在祢爱里
这根基不会动摇
我已选择要单信靠祢
心坚定不被动摇
`,
`
为爱和合一祷告

V1
主啊  求祢怜悯医治这地
所有纷争仇恨远离这地方
求主的爱医治一切的伤口
祢是医治者  祢是真爱的源头

V2
主啊  求祢赦免我们一切软弱
赐我们一颗谦卑爱人的心
求主的爱抚平一切的伤痕
我们仰望祢  祢是和平的君王

C
遵行主教导  我们彼此相爱
只有爱能使我们合而为一
心连心手牵手  我们同心祷告
愿真爱充满每一个角落
`,
`
你是配得

V
圣哉圣哉全地唱
昔在今在以后永在
圣哉圣哉全能神
永远在宝座上

C1
祢是配得  配得
配得尊崇和赞美
祢是配得  配得
万物敬拜祢

C2
祢是圣洁  圣洁
圣洁荣光在全地
祢是圣洁  圣洁
以圣洁妆饰敬拜祢

B
愿尊贵  荣耀  权柄和能力
都归全能神
愿各族  各方  万国和万邦
敬拜神羔羊
`,
`
盼望圣灵

V
将我眼目  聚焦于祢  喔  耶稣
将我全心  来回应祢的爱
放下恐惧  我全人降服于祢
我王  我敬拜祢

C1
主我渴慕祢同在
主我渴慕祢同在
盼望圣灵  使我更加靠近祢
生命活泉  涌流进入我心

C2
主我渴慕祢同在
主我渴慕祢同在
盼望圣灵  使我更加靠近祢
生命活泉  涌流进入我心
当我敬拜祢

B1
从我心深处  呼求祢
倾倒我全心全意赞美
从我心深处  我呼求祢
全然降服祢

B2
向祢唱出  爱的旋律
毫无保留  全然属于祢
从我心深处  我敬拜祢
主唯有祢
`,
`
认定你

V1
我要专心仰赖祢
不倚靠自己的聪明
在所行的事
都要认定祢

V2
我要专心跟随祢
不倚靠自己的能力
在所行的路
祢必指引

C1
将祢的话语系在颈项上
刻在心版上
主啊  我站立敬畏祢

C2
祢是道路真理和生命
走近祢心意
献上一切  主啊  我尊荣祢
`,
`
这世代

V1
看哪犹大狮子已得胜  众圣徒预备朝见祂
少年人看异象  老年人要作异梦
因为神的复兴将来到

V2
听到锡安的号角响起  万国万民都要颤抖
耶和华日子将到  光明将除去黑暗
因为神的复兴将来到
我们要看到神的荣耀

C
这世代我们用敬拜争战
我们用祷告改变世界
这世代圣灵要更新浇灌我们
这世代是耶稣世代
`,
`
耶稣你是中心

V1
耶稣全世界万有的主
耶稣全世界万有的主
从起初直到最后  我心的依靠
永远都是祢耶稣  耶稣

V2
耶稣我全人生命的主
耶稣我全人生命的主
从起初直到最后  生命的救主
永远都是祢耶稣  耶稣

V3
耶稣成为我教会的主
耶稣成为我教会的主
万膝都要跪拜  万口要承认
祢是救赎主耶稣  耶稣

C
我心别无所求
无人能与祢相比
耶稣祢是中心
我一切都围绕着祢  只为祢

B
从我心直到诸天  耶稣祢是唯一
我全然为祢  一切全然为祢
`,
`
坐在宝座上圣洁羔羊

V1
坐在宝座上圣洁羔羊
我们俯伏敬拜祢
昔在今在以后永在
唯有祢是全能真神

V2
坐在宝座上尊贵羔羊
我们俯伏敬拜祢
颂赞尊贵荣耀权势
都归给祢直到永远

C
万王之王  万主之主
唯有祢配得敬拜和尊崇
万王之王  万主之主
我们高举祢圣名直到永远
`,
`
我愿降服

V1
我能去哪  除了祢施恩座前
我降服于  祢十架的恩典
何等的爱  祢大能手扶持我
太荣美  何等荣美

V2
荣耀君王  祢的鞭伤能医治
神的儿子  彰显恩典真实
何等的爱  带我进入祢恩慈
真美好  祢真美好

C
我愿降服  高举祢名
耶稣  祢得荣耀
我所有和我生命
我属祢  永远属祢

B
此时此地  愿祢升起
祢得荣耀就在这里
从天堂到地极  神祢赎回我生命
我属祢  永远属祢
`,
`
大山为我挪开

V
虽然道路崎岖  困难险阻
但我心中知道  祢一直都在
不能明白为何担此重担
但我始终相信  祢一直牵着我

C
大山为我挪开  大海有路出来
我要大声宣告  耶稣  祢一直都在
祢手上的钉痕  彰显十架大爱
我要大声宣告  耶稣  祢一直都在

B
祢的话让我明白  祢爱我永不更改
祢保守我的心怀  紧握祢双手不放开
`,
`
主赐给我的所有恩典

V1
耶稣祢的爱拴住了我
灵里喜乐高声来歌唱
这希望的土地  是主所喜悦的
我要把爱奉献给祢

V2
耶稣祢的灵临格在我身
灵里喜乐高声赞美主
这神圣的土地  是主所眷顾的
我要全心来敬拜祢

C
主赐给我的所有恩典
我浑身是口说不尽
我全心跟随祢  赐我乐意的灵
把这生命奉献给祢
`,
`
十字架的传达者

V1
耶稣祢的爱拴住了我
灵里喜乐高声来歌唱
这希望的土地  是主所喜悦的
我要把爱奉献给祢

V2
耶稣祢的灵临格在我身
灵里喜乐高声赞美主
这神圣的土地  是主所眷顾的
我要全心来敬拜祢

C
主赐给我的所有恩典
我浑身是口说不尽
我全心跟随祢  赐我乐意的灵
把这生命奉献给祢
`,
`
新的异象新的方向

V1
有敬拜的声音发出
从最高的山到海洋深处
神的儿女要唱一首新歌
我们神要做新事

V2
旧的事都已经过去
在基督里一切都要更新
新的眼界  新的异象
新的故事  新的方向

C1
全地都要渴望呼喊
荣耀的主我愿祢来
天要敞开恩膏倾倒下来
神国度的荣耀彰显

C2
全地都要渴望呼喊
荣耀的主我愿祢来
圣灵引领看见新的异象
祢要做新的事在我们中间
`,
`
万王之王

V1
在⿊暗中我们等待  没盼望  没光明
直到祢从天堂奔来  祢眼中满有怜悯
为应验律法和先知  真道出⾃童贞⼥
从⽆限荣耀宝座上  降在污秽⻢槽⾥

V2
为彰显祢国度降临  失丧的与神和好
为赎回祢所造万物  祢⽢愿承受⼗架
当祢还在苦难之中  已看⻅前⾯喜乐
定意为要拯救我们  耶稣祢舍出⽣命

V3
在祢复活的清晨  众天堂屏住呼吸
直到⽯头被挪开  羔⽺胜过了死亡
死去的圣徒复活  天使都敬畏站⽴
凡愿前来的灵魂  都回归天⽗⾝边

V4
基督的教会诞⽣  圣灵点燃了⽕焰
这亘古福⾳真理  不衰退不妥协
因为祂宝⾎圣名  我得⾃由得释放
因耶稣基督的爱  赐给我复活⽣命

C
赞美圣⽗与圣⼦
赞美圣灵三⼀神
荣耀真神⾄⾼主
赞美永归于万王之王
`,
`
愿赞美充满

V1
愿赞美充满每个家
愿喜乐充满我心
愿万物都尊崇耶稣
让我们献上祈求

V2
愿主真光照亮黑暗
愿我们屈膝敬拜
愿主荣耀充满全地
让我们同声宣扬

C
从高山上  直到山谷
颂扬赞美献给祢
从天降下  直到万民
让这歌声传千里

B
哈利路亚  哈利路亚
哈利路亚  哈利路亚
`,
`
我在这

V
我在这  是因祢恩典
我在这  是因祢慈爱
主耶稣  我如此感恩
都因祢丰盛恩典

C
感谢耶稣  耶稣
耶稣  感谢耶稣
只因着祢恩典  使我能为祢活
我赞美祢直到永远
`,
`
充满我

V
我的心惟有祢  我的灵渴慕祢
我全人献给祢  以全心赞美祢
举双手敬拜祢  深深说我爱祢
我的神我的主  我渴望亲近祢

C
充满我浇灌我  使我灵得满溢
充满我洁净我更新我
充满我滋润我  让祢爱来围绕我
我一生我一世属于祢
`,
`
前来敬拜

V
哈利路亚  哈利路亚
前来敬拜永远的君王
哈利路亚  哈利路亚
大声宣告主荣耀降临

C
荣耀尊贵  能力权柄归于祢
祢是我的救主  我的救赎
荣耀尊贵  能力权柄归于祢
祢是配得  祢是配得
祢是配得我的敬拜

B
荣耀尊贵  美丽无比
神的儿子  耶稣我的主
荣耀尊贵  美丽无比
神的儿子  耶稣我的主
`,
`
打开天窗

V1
愿我  我的祷告
如香陈列在祢面前
没有黑暗势力
可以摇动我的信心

V2
愿我  我的敬拜
到祢面前  蒙祢悦纳
天使天军屈膝
俯伏敬拜在祢宝座前

C1
打开天窗  打开天窗
愿我的祷告打开天窗
愿祢充满  祢的荣耀
祢的同在在这地

C2
打开天窗  打开天窗
愿我的敬拜打开天窗
我们只要祢的荣耀
祢的同在在这地  在这地

B
愿我的祷告如香  愿我的祷告如香
愿我的祷告如香  愿我的祷告如香
献在祢面前
`,
`
你是荣耀的君王

V1
祢是荣耀的君王
祢是和平之主
祢是天地万有主宰
惟有祢圣洁公义

V2
天使都向祢跪下
敬拜尊崇祢
因为在祢有永生之道
祢是主耶稣基督

C
和散那归于大卫的子孙
和散那归于万王之王
愿荣耀归于至高神
耶稣是弥赛亚
`,
`
完全完美我的主

V
完全完美我的主
求祢引我走公义的道路
所行的一切都为主的荣耀
都敬拜主的名

C
主我敬拜祢  主我赞美祢
唯有祢能支配我的一切
主我敬拜祢  主我赞美祢
唯有祢是配得尊贵荣耀
`,
`
带我进入幔内

V1
带我进入幔内
带我进入幔内
宝座前  与祢相见面对面
亲近祢  是何等甘甜

V2
带我进入幔内
带我进入幔内
宝座前  与祢相见面对面
敬拜祢  是何等宝贵
`,
`
荣耀大君王

V
将祢的光照亮在我们身上
让我们在祢面前毫无隐藏
打开我们的心  我要看见
祢的国度就在这里彰显

Pc
在祢光中我得见光
在祢里面有丰盛盼望
荣耀荣耀  荣耀荣耀
圣洁  大君王

C
荣耀耶稣  耶稣  耶稣  主耶稣
欢迎祢在我们中间
荣耀耶稣  耶稣  耶稣  主耶稣
祢是配得荣耀  大君王
`,
`
天国的子民

V
我们是天国的子民
我们是上帝的宝贝
我们是光明之子 神儿女
我们是天国的子民

C1
我们要彼此真诚相爱
我们要活出圣洁生命
让世人从我们身上闻到
耶稣的馨香之气

C2
我们要在主里面合一
我们要活出爱的生命
让世人看见我们就知道
我们是天国的子民

B1
我们是天国子民
我们是神的宝贝
我们是光明之子
我们是天国子民

B2
我们要彼此相爱
我们要彼此合一
我们是天国子民
`,
`
圣洁归于你

V
耶稣祢名超乎万名之名
在世上无一人能相比
耶稣所有权柄尊荣归于祢
齐宣告  让世界都知道

C
圣洁圣洁  圣洁归于祢
荣耀荣耀  归于主圣名
圣洁圣洁  圣洁归于祢圣名
万膝跪拜  还要敬拜我主

B
万国万邦  万口承认
耶稣基督是荣耀君王
万国万邦  万口承认
耶稣基督是荣耀君王
`,
`
奔跑不放弃

V
每个狂风暴雨里  祢同在在那里
每个难处低谷里  祢恩典在那里
每个伤心失望里  祢爱我爱到底
在祢爱的光中  我得着能力

C
我爱祢  用尽我全心全意全力
荣耀高举祢的名  我跟随不怀疑
我爱祢  用尽我全心全意全力
在这爱的路程里  我奔跑不放弃

B
四面受敌  却不被困住
心里作难  却不至失望
至暂至轻的苦楚要成就
极重无比永远的荣耀
`,
`
主你是我力量

V
我的诗歌  我的拯救
祢是我患难中随时的帮助
众山怎样围绕耶路撒冷
祢必围绕我到永远

C
主祢是我力量  主祢是我高台
坚固磐石我信靠祢必不动摇
主祢是我力量  主祢是避难所
我的盼望只在乎祢
`,
`
复兴圣洁

V
主  求祢复兴我  心中的圣洁
为我造清洁的心  使我重新有正直的灵
主  求祢复兴我  心中的圣洁
将我分别为圣  作祢尊贵荣耀器皿

C1
我将身体献上当作活祭
一生作祢圣洁的器皿
我将生命献上为祢而活
为祢呼吸

C2
我将身体献上当作活祭
一生作祢圣洁的器皿
一生传扬基督的圣名
`,
`
当你找到我

V
当祢找到我  在生命十字路口
祢靠近我  祢拥抱我  从此祢不放手
过去的种种  全然交在祢手中
祢医治我  祢恢复我  从此我不放手

Pc
夜再黑  心再疲惫  我仰望祢至圣荣面
我已决定永不后退
祢作为  何等荣美  祢大能在我心间
我愿一生紧紧跟随

C1
我跟随祢  从高山到低谷
我跟随祢  即使荆棘满布
纵然面对挑战  也有眼泪  感到疲惫
我要挣脱缠累  永远不后悔

C2
在祢翅膀荫下  我得保护
祢话语使我  生命得坚固
祢应许不摇动  自始至终  永不落空
未来在祢的手中  我不忘初衷
`,
`
如今我信靠

V
被击倒却不羞愧  被攻击却仍跟随
祢有足够恩典  祢有足够恩典
被试炼却不跌倒  被孤立却不动摇
我宣扬祢真好  我宣扬祢真好

C
如今我信靠  盼望中知道
我神  永远都不动摇
神与我同在  祂全然得胜
我神  永远都不动摇

B
祢开始就必成就  我刚强在祢爱中
祢名稳妥
祢为我们争战  盼望永远不失落
在祢手中
`,
`
愿你荣耀遍及全地

V1
让我歌唱  来赞美祢名
举起我的双手敬拜祢
愿祢荣耀遍及全地

V2
更新我灵  渴慕祢圣灵
放下我的所有荣耀祢
哈利路亚  哈利路亚

C1
在万民中称谢祢
在万族中歌颂祢
因祢慈爱伟大
祢的信实高及诸天

C2
在万民中称谢祢
在万族中歌颂祢
神啊  愿祢被尊崇
愿祢荣耀遍及全地
`,
`
神的信实良善

V1
主我爱祢  祢的怜悯永不改变
每一天  祢的恩手扶持我
清晨当我睁开双眼  直到我躺卧
我要歌唱  神的良善荣美

V2
祢的声音  领我经过水火试炼
黑暗中  如此亲近我的灵
祢是我的天父  祢是我良友
一生活在  祢的良善荣美

C
一生信实对我顾念
一生美好待我  到永远
一切所有生命气息
要歌唱  神的良善荣美

B
祢良善永看顾我  永伴随我生命
祢良善永看顾我  永伴随我生命
当我降服祢  我献上生命  所有全属于祢
祢良善永看顾我  永伴随我生命
`,
`
将天敞开

V
将天敞开  祢的荣耀降下来
将天敞开  祢的同在降下来
将天敞开  祢的荣耀降下来
万国赞叹祢  祢是荣耀君王

C
天上地下  合一敬拜
欢呼耶稣基督圣洁羔羊  荣耀归于祢
天上地下  在永恒里敬拜
哈利路亚  哈利路亚

B
神就在这里  我们欢迎祢
让一切焦点转向祢
神就在这里  我们欢迎祢
宝座前敬拜不停息
`,
`
我要一心称谢你

V
我要一心称谢祢
在诸神面前歌颂祢
我要向祢的圣殿下拜
为祢慈爱和诚实称赞祢名

C1
我要歌颂耶和华作为
因祢慈爱永远长存
我虽行在困苦患难中
祢应许必将我救活

C2
我要歌颂耶和华作为
因祢的名大有荣耀
我呼求时祢必应允我
鼓励我使我心里有能力

Coda
祢必成全关乎我的事
祢必不离弃祢手所创造的
`,
`
唯有耶稣

V
耶稣祢能  使瞎眼看见
耶稣祢能  医治伤心人
耶稣祢有  权柄释放
叫不可能变为可能

C
唯有耶稣掌管天地万有
唯有耶稣能使水变成酒
叫狂风巨浪平息  大能赦罪行神迹
耶稣无人与祢相比
`,
`
惟有基督

V1
惟有基督是我盼望
是我光明 力量 颂赞
历经荒漠风暴锤炼
坚如磐石  是我倚靠

C1
慈爱至高  平安至深
驱散恐惧  平息风浪
我的安慰  我的一切
在基督爱里我站立

V2
惟有基督道成肉身
全权之神成为婴孩
从天赐下慈爱公义
受尽凌辱为救世人

C2
主在十架  舍身受死
将神忿怒全然挽回
我的罪孽祂全承担
因基督之死我得生

V3
救主舍身  受死埋葬
黑暗掩面世界之光
荣耀之日  冲破幽暗
脱离死亡  救主复活

C3
荣耀救主  全然得胜
从罪恶中将我释放
我在主里  主在我里
蒙基督宝血我得赎

V4
无论生死  坦然无惧
生命满载基督能力
一生一世  无时无处
基督掌管人生道路

C4
阴间权势  恶人技俩
无法将我与祂隔绝
直到主来  或召我去
靠基督能力我坚立
`,
`
在呼召我之处

V1
主温柔的圣灵  让我全心感受
渗透我的生命  赐下平静和安息
祢使我心得满足

V2
主慈爱的真理  祢荣光照向我
包围我的身体  赐下平静和安息
让我感受祢的爱

C
在呼召我之处  我要献上敬拜
无论遭遇何事  依然扬声歌唱

B
在我行走时成为我道路
活着时成为我生命
就在这地  献上敬拜
`,
`
求圣灵运行

V
在这时刻求圣灵运行
来充满我们的心
改变我们  让我们更像祢
让我们把自己完全献给祢

C1
噢 主圣灵  噢 主圣灵
充满在这里
叫我们的灵
能在祢光中  再一次兴起

C2
噢 主圣灵  噢 主圣灵
充满在这里
来充满我们的心
让我们明白祢所有旨意
`,
`
恩友歌

V1
何等恩友慈仁救主
负我罪孽担我忧
何等权利能将万事
来到耶稣座前求

C1
多少平安我们坐失
多少痛苦冤枉受
都是因为未将万事
来到耶稣座前求

V2
我们有无试探引诱
有无难过苦关头
决不应当因此灰心
仍当到主座前求

C2
何处能寻这般良友
同尝一切苦与愁
我们弱点主都知道
放心到主座前求

V3
我们是否软弱多愁
千斤重担压肩头
主仍做我避难处所
奔向耶稣座前求

C3
你若真逢友叛亲离
好向耶稣座前求
到祂怀中祂必保护
有祂安慰便无忧
`,
`
你配得全所有

V
众圣徒众天使  俯伏宝座前
众长老谦卑
卸下冠冕在神羔羊前敬拜

C
祢配得全所有  祢配得全所有
祢是万物源头  一切都归于祢
配得所有荣耀
`,
`
凡事都能做

V
信是未曾看见
依然仰望十架
信是完全交托
深知主已掌权

C
我靠着那加给我力量的  凡事都能做
或风浪或低谷  主平安在我心
我靠着那加给我力量的  凡事都能做
行在主的旨意  我凡事都能做
`,
`
诗篇二十三篇（生命河灵粮堂）

V1
耶和华是我的牧者  我必不致缺乏
祂使我躺卧青草地上
领我在可安歇的水边

C1
祂使我的灵魂苏醒  使我灵魂苏醒
为自己的名引导我走义路
引导我走义路

V2
我虽然行过死荫幽谷  也不怕遭害
因为祢与我同在
祢的杖和竿都安慰我

C2
在我敌人面前祢为我摆设筵席
祢用油膏了我的头  使我福杯满溢

C3
我一生一世必有恩惠慈爱随着我
我且要住在耶和华的殿中
直到永永远远
`,
`
这是圣洁之地

V
这是圣洁之地  神在这里
前来献上最深的敬拜
这是圣洁之地  神在这里
设立宝座  在荣耀的敬拜里

C
我全心来敬拜祢主  高举双手敬拜祢主
在祢大能荣耀光中  我俯伏在祢宝座前
我全心来敬拜祢主  高举双手敬拜祢主
在祢大能荣耀光中
我与众天使俯伏 深深敬拜祢
`,
`
我神真伟大

V1
尊贵荣耀君王  在全地之上
愿万民都喜乐  全地都喜乐
主祢满有荣光  黑暗都躲藏
万民高声唱  齐来高声唱

V2
昔在永在君王  从今直到永远
祢从不曾改变  永存在天地间
祢是三一真神  父子与圣灵
真神的羔羊  全能神羔羊

C
我神  真伟大
歌颂祢圣名  真伟大
全地都看见  我神  真伟大

B
祢至圣尊名  配受大赞美
全心歌颂  我神  真伟大
`,
`
恩典之流

V
主圣灵  轻轻呼唤着我的姓名
黑暗中  祢爱牵引着我
喔我神  我的心单单渴慕敬拜祢
天使围绕  带领我看见祢

C1
十架上担当我罪和羞愧
忍受鞭伤交换我生命
恩典之流  恢复我得洁净
与我同在  使我坚定

C2
主的爱穿越高山直到地极
赐下恩惠阳光在这地
恩典之流  敬畏中我站立
慈爱怜悯  淹没我的心

E
此生充满主恩典  因祢宝血信实完全
我渴望见祢荣面  述说祢奇妙荣美
`,
`
神羔羊

V
主啊 我来到祢宝座前  我心向祢敬拜
在玻璃海我要敬拜  俯伏在祢圣洁中
主啊 我来到祢宝座前  全人向祢跪拜
愿尊贵 荣耀和感谢  都归宝座被杀羔羊

C
神羔羊  医治者
赦我罪  赐自由
神羔羊  医治者
我的心称颂
`,
`
你是圣洁

V
耶稣祢是何等圣洁美丽
万人中无人能与祢相比
耶稣祢是永恒明亮晨星
荣耀尊贵  再来君王

C
主 祢是圣洁  配得一切尊崇与赞美
永远尊贵  永远荣美  我们谦卑俯伏敬拜
主 祢是圣洁  从永远到永远不改变
何等尊贵  何等荣美  我们谦卑俯伏敬拜

Coda
圣洁真神  祢荣耀充满在全地
`,
`
我要爱慕你

V
耶稣  我要爱慕祢
我要爱慕祢  倾倒我的生命
祢是  我唯一所求
让我心单单渴慕祢

C
我心满溢  我心满溢
对祢的爱和思念无止尽
让我走向祢的身旁贴近祢
主啊 我渴慕寻求祢
`,
`
满有能力

V
我的盼望  就在耶稣基督里
在祢里面  满有平安
生命泉源  就在耶稣基督里
有主在我里面活着

C
我宣告在我里面的  比世上一切更有能力
我不属这世界  我高举耶稣的名
我宣告在我里面有  活水涌流满有能力
有耶稣在我里面活着  我勇敢站立

B
有主在我里面  没有惧怕能战胜仇敌
有主在我里面  没有惧怕还得胜有余
`,
`
生命在于你

V
生命在于祢主
力量在于祢主
盼望在于祢主
在祢 在于祢

C
我要以生命来赞美祢
我要尽全力来赞美祢
全心赞美祢  全力赞美祢
我的盼望在于祢
`,
`
你真好

V
祢慈爱  使我回转向祢
祢良善  吸引我靠近
祢怜悯  呼召我更像祢
祢恩典  满足我心

Pc
在每一天  唤醒我灵赞美
用我全心  来歌唱

C
祢真好  祢真好  祢真好
祢怜悯直到永远

B
祢慈爱直到永远  祢良善直到永远
祢怜悯直到永远  到永远
`,
`
医治我

V
压伤的芦苇祂不折断
将残的蜡烛祂不吹熄
一生的年岁在祂手里
平安喜乐都陪伴我
平安喜乐都陪伴我

C
医治我  我必得痊愈
万军之耶和华  全能的主
医治我  我必得痊愈
如鹰展翅上腾  奔跑走天路
`,
`
活祭

V
主我是一个活祭
我不再属于自己
甘心乐意献给祢
一生一世永属祢

Pc
我的生命  每个气息
全是祢所赐予
财富能力  血汗热情
理当献上归祢  哦

C
膏我 用我  从天降下火
愿祢悦纳  献上的所有
膏我 用我  从天降下火
愿祢悦纳  献上的所有
`,
`
无人能与你相比

V1
永活全能的主宰
道成肉身显明祢的爱
奇妙主  荣耀神
何等的伟大

V2
圣洁尊贵的君王
超乎万名在全地之上
为我罪  流宝血
赎回我生命

Pc
无人能与祢相比
祢掌权直到永远
我要扬声赞美祢

C1
喔  何等伟大的爱
高过诸天深海
当受极大赞美  喔

C2
喔  主祢满有能力
世界盼望是祢
我要敬拜祢  耶稣我的主
`,
`
这是耶和华所定日子

V
这是耶和华所定日子
神的儿女当欢呼喜乐
耶和华已战胜仇敌  战胜仇敌
全地大声欢呼

C
耶和华是我力量  我心中一切的盼望
耶和华是我的诗歌  又是我的拯救
神子民行走全地  报好消息宣告祢的名
高举得胜的旌旗  我们称谢祢  祢是我神
`,
`
何等爱你

V1
何等爱祢 阿爸天父
祢无条件为我付出
牺牲爱子叫我得赎
祢爱充满我

V2
主祢宝血为我而流
洗净我罪给我自由
祢的爱是何等伟大
喔喔  主耶稣

C
一生要赞美  我美好救主
祢的爱是我生命全部
一生要敬拜  我亲爱天父
祢无条件的爱让我心得满足
`,
`
圣洁和荣耀

V1
荣耀  喔荣耀
等候祢荣耀降临
俯伏  放下我的冠冕
从心底深处敬拜祢

V2
圣洁  喔圣洁
渴慕祢圣洁降临
触摸  充满祢的子民
我们受造为敬拜祢

C
圣洁和荣耀
不停献上  都归真神羔羊
颂赞和爱戴
都归耶稣  永恒君王

B
荣耀都归祢  能力都归祢
耶稣  祢名超过世上的万名
天上和地下  所有受造的
都要俯伏敬拜荣耀祢
`
];

for (var i = 0; i < lyricsLibrary.length; i++) {
    lyricsLibrary[i] = lyricsLibrary[i].trim();
}
